// pages/about-us.tsx
import Image from "next/image";

const AboutUsPage = () => {
    return (
            <div className="relative flex h-full w-full overflow-hidden px-4">
                <main className="relative flex  max-w-full flex-1 flex-col overflow-hidden mt-28">
                    <h1>«Світ Біблії» – «World of the Bible»</h1>
                    <h2>Опис проєкту</h2>
                    <section id="annotation" className="scroll-mt-40">
                        <h3>Анотація</h3>
                        <p>
                            Проєкт призначений для абсолютно вільного і безкоштовного залучення різних категорій
                            користувачів до
                            ознайомлення з різноманітними джерелами, що пов’язані між собою взаємними посиланнями.
                            Погодження з
                            запропонованими програмним забезпеченням переходами за посиланнями будуть поступово
                            наближати
                            користувачів до ознайомлення з біблійною традицією і подальшого її вивчення.
                        </p>
                        <p>
                            Опис проєкту (далі «документ») дає необхідну інформацію про фундаментальні принципи, цілі і
                            основні
                            властивості проєкту. Крім того документ відповідає на питання співробітників і волонтерів
                            про
                            відповідність задуму проєкту особистим життєвим цілям кожного з них.
                        </p>
                        <p>Документ також містить необхідну інформацію для подачі заявок на виділення грантів.</p>

                    </section>
                    <section id="vision" className="scroll-mt-40">
                        <h3>Візія</h3>
                        <p>
                            Ми (тут і далі «ми» – це команда співробітників і волонтерів проєкту) виходимо зі
                            твердження, що
                            світ створений Богом як єдине творіння, в якому всі речі, всі істоти і явища, певним чином,
                            органічно поєднані одна з одною. Бог проявляє Себе в створеному світі як центр, до якого
                            тягнеться
                            все творіння. Людина створена за образом Творця і поставлена на чолі створеного світу. Метою
                            Творця
                            всього, що існує, є примноження Божої любові, яка являє себе у поєднанні всього створеного в
                            одному
                            організмі з Богом та за Його задумом. І ця ціль буде досягнута, попри спокуси, втрату
                            з’єднання
                            людини з Богом, падіння людей в раї та розпаду єдиного організму.

                        </p>
                        <p>
                            Нестворений Бог абсолютно перевершує розумом і силами всіх створених за Його образом. Він
                            принципово
                            непізнаний розумними створіннями, і тому пізнання якоїсь сторони Божого єства можливе лише
                            як Його
                            одкровення. Писаним одкровенням Бога людству є Біблія – Старий і Новий Завіт, перекладені
                            більшістю
                            мов народів світу.
                        </p>
                        <p>З іншого боку ми бачимо людей, створених за образом Божим для уподібнення Творцеві,
                            нагороджених Ним
                            різноманітними талантами, покликаних для творчості, і вже тільки в цьому ми можемо бачити
                            умову
                            тяжіння людей до Бога. Всі подібні тяжіють до Подібного. Людські таланти різні, але в цьому
                            проєкті
                            ми зосереджуємо увагу на авторах талановитих книжок, наукових праць, високоякісної (високої)
                            художньої літератури. Їхні книжки є проявом Божого дару, творчого натхнення, і тим вказують
                            на своє
                            джерело.</p>
                        <p>Ці книжки не обов’язково мають бути безпосередньо пов’язані з біблійним матеріалом або з
                            роботами з
                            дослідження Біблії. Зв’язок можливий через спільні ідеї, а також, опосередковано, через інші
                            книги
                            та більш наближені до Біблії тексти. Функції програмного забезпечення, робота співробітників
                            і
                            волонтерів нашого проєкту мають виявити наявні зв’язки різних джерел, довести їх до рівня
                            посилань,
                            натискання на котрі перенесе користувача на певне місце в іншому джерелі, яке обертається на
                            тій або
                            іншій орбіті. Тут, для ілюстрації візії нашого проєкту, хотілося б навести наступний
                            малюнок. </p>

                        <Image
                            className="fit-picture mx-auto block"
                            src="/images/image-about-page.png"
                            alt="image-about-page"/>

                        <p>На ньому можна побачити щось подібне до Сонячної системи. Її центральним світилом є Біблія.
                            На
                            найближчих до неї орбітах, подібно планетам, обертаються книжки та роботи авторів з
                            біблійної
                            текстології, герменевтики, екзегетики, ісагогіки. На більш віддалених орбітах знаходяться
                            книжки з
                            історії біблійного канону, патристики, біблійної критики, апокрифи й ранні переклади. Ще
                            далі –
                            орбіти книжок з біблійної історії та релігійної філософії, а також філософії та історії
                            взагалі. І
                            нарешті, орбіти книжок авторів високої художньої літератури.</p>
                        <p>Всі книжки та джерела зі своїми посиланнями на інші, створюють Інформаційний Простір Проєкту
                            (ІПП). В
                            цьому контексті, користувачі – це вільні мандрівники, дослідники тіл, що обертаються на
                            різних
                            орбітах ІПП і всієї системи в цілому.</p>
                        <p>Свобода вибору джерел мандрівниками й дослідниками є однією з цінностей, про яку піде мова у
                            відповідному розділі опису проєкту. Вона не буде обмежуватись, але у самому устрою світу
                            закладені
                            зв’язки та діє сила тяжіння, яка, без насильства ззовні, притягує мандрівників і дослідників
                            до
                            центру Світу Біблії, до Бога.</p>
                        <p>У кожного самостійного мандрівника буде програмний помічник (умовно, Гід), який попереджатиме
                            його
                            про можливі зміни траєкторії, куди саме ведуть існуючи посилання і виконуються переходи.
                            Хочемо
                            зауважити, що наші користувачі не приречені на самотність, в реалізації проєкту будуть
                            включені
                            засоби для комунікацій, поки що це форум, на який, за згодою користувача, також може
                            привести
                            Гід.</p>
                        <p>Завдяки цим засобам, користувачі зможуть комунікувати між собою, створювати групи,
                            дізнаватись, що
                            серед них є люди з більшим досвідом, лідерськими якостями, талановиті вчителі, пастори,
                            викладачі,
                            які користуються авторитетом.</p>
                        <p>За кожним користувачем фіксуються траєкторії всіх його мандрівок в ІПП та всі його дії,
                            завдяки чому
                            він може повертатися до будь-якого зафіксованого там місця, ділитися своїми траєкторіями або
                            їхніми
                            частинами з іншими. Для цього в нашому проєкті передбачено особливий засіб – «Навігатор»,
                            який
                            проведе користувача по обраній ним траєкторії, що запропонована одним з лідерів спільноти
                            або іншим
                            користувачем.</p>
                        <p>За умови використання контрольних питань і різноманітних контактів на форумі, траєкторії
                            можуть мати
                            навчальний характер. Такі можливості будуть одночасно привабливими та корисними для лідерів
                            груп і
                            спільнот, які зможуть створювати траєкторії, маючи на меті навчання, або передачу іншим
                            свого
                            досвіду по певній навчальній програмі.</p>

                    </section>
                    <section id="mission" className="scroll-mt-40">
                        <h3>Місія</h3>
                        <p>
                            Утвердження в вірі приводить людей до відповіді на євангельське покликання, до дієвої
                            проповіді
                            основ віри у світі. Єдність віри і надії торує шлях до наближення і поєднання людей один з
                            одним і
                            їх усіх з Богом.
                            Творець всього, що існує, Всемогутній Бог, створивши одну людину за Своїм образом, чоловіка
                            і жінку
                            в єдиному організмі, вважає неможливим для Себе покласти нездоланну для людини перепону до
                            переступу
                            Своєї єдиної заповіді, даної Адаму в раї. Така перепона була б обмеженням її свободи вибору,
                            тобто
                            того, що поєднує образи людей і їх Творця.

                        </p>
                        <p>
                            Бог дозволив статися катастрофі – падінню всього створеного. Падіння людини призвело до
                            розпаду його
                            довершеного та універсального організму, так виник «світ цей». Але мета Бога, заради якої
                            створений
                            світ, залишається незмінною, і вона буде неодмінно досягнута.
                        </p>
                        <p>Можливо хтось скаже: якщо це так, тоді навіщо усіляка людська метушня з «проєктами», адже все
                            буде
                            виконано і без нас? Нашою відповіддю буде – «так», але ознакою нашого особистого з‘єднання з
                            Творцем
                            буде дієва співучасть у виконання Його задуму про людство і світ, в якій мають бути залучені
                            всі
                            складники – наше тіло, душа і дух, вся повнота людської природи.</p>
                        <p>Ось чому ми й обрали своєю місією створення ІПП нашого проєкту, його технічного і програмного
                            забезпечення. І саме тому ми будемо активно залучати користувачів і шукачів у всьому світі
                            для
                            вільного ознайомлення з джерелами ІПП, допомагати їх наближенню до біблійної традиції,
                            вивченню
                            Біблії та створенню груп і спільнот на основі спільних інтересів, віри та надії. </p>


                    </section>
                    <section id="goal" className="scroll-mt-40">
                        <h3>Мета</h3>
                        <p>
                            Боже творіння, про яке йшлося в розділі «Візія», – абсолютно досконале. Незважаючи на
                            гріхопадіння і
                            розпад, Божа мета про створення світу, як єдиного організму, і людини, як його голови, для
                            примноження любові, залишається незмінною. В світі цьому продовжує діяти чинник і природна
                            сила, які
                            без дій з зовні, пов’язують, наближують, створюють умови для поєднання творіння зі своїм
                            Творцем.

                        </p>
                        <p>
                            Світ і людство будуть очищені, відновлені і поєднані в любові між собою і своїм Творцем.
                            Таку мету
                            має Бог і вкладає Свою творчу силу в її досягнення.
                        </p>
                        <p>Згідно з цим, ми визначаємо мету проєкту, спрямовуючи її на досягнення мети Творця. Ми
                            вкладаємо свої
                            зусилля в досягнення цієї мети і ці наші зусилля не зовнішні, а є відповіддю на покликання,
                            відповідним проявом Божого дару. </p>
                        <p>Основними напрямками роботи команди співробітників і волонтерів в досягненні цієї мети ми
                            бачимо в
                            наступному. </p>
                        <ul>
                            <li>Робота по постійному відбору та підготовці якісних джерел для наповнення ІПП.</li>
                            <li>Розробка і постійна підтримка всіх згаданих в розділі «Візія» технічних засобів і
                                програмного
                                забезпечення.
                            </li>
                            <li>Розповсюдження інформації про проєкт в інтернеті, соцмережах, а також іншими засобами.
                            </li>
                            <li>Залучення користувачів різних категорій від мало- або зовсім незнайомих з біблійною
                                традицією до
                                науковців і викладачів предметів біблеїстики.
                            </li>
                            <li>Залучення до команди співробітників і волонтерів проєкту наших однодумців по всьому
                                світу.
                            </li>
                        </ul>

                    </section>
                    <section id="strategy" className="scroll-mt-40">
                        <h3>Стратегія</h3>
                        <p>
                            Стратегічним напрямком досягнення мети нашого проєкту є залучення достатньої і постійно
                            зростаючої
                            кількості різних категорій користувачів. Розглянемо ці категорії більш детально:
                        </p>
                        <ol>
                            <li>Вільні мандрівники по ІПП, мало- або зовсім незнайомі з біблійною традицією користувачі.
                            </li>
                            <li>Користувачі, що вже знайомі з біблійною традицією.

                            </li>
                            <li>Користувачі, що вивчають біблійну традицію.
                            </li>
                            <li>Лідери груп і спільнот, які склалися на форумі, з-поміж знайомих з біблійною традицією,
                                а також
                                пасторів, вчителів і інших авторитетних осіб.

                            </li>
                            <li>Науковці – автори наукових праць і викладачі предметів з біблеїстики в освітніх
                                закладах.
                            </li>
                        </ol>
                        <p>
                            З огляду на наведені вище категорії користувачів, наша стратегія буде включати наступні
                            пункти:
                        </p>
                        <ol>
                            <li>Важливішим чинником з залучення ми вважаємо абсолютно безплатний, вільний доступ всіх
                                користувачів до всіх джерел ІПП і інших ресурсів, а також зручний програмний інтерфейс.
                                Особливо
                                це стосується користувачів категорій (1) і (2).
                            </li>
                            <li>Ключовим фактором успіху залучення користувачів категорій (3) і (4) є залучення
                                користувачів
                                категорій (1) і (2), а також включений в ІПП форум, що активно діє.
                            </li>
                            <li>Успіх з залученням представників категорії (5), певною мірою, буде визначатися успіхом у
                                залученні користувачів категорій (3) і (4).
                            </li>
                        </ol>

                    </section>
                    <section id="values" className="scroll-mt-40">
                        <h3>Цінності</h3>
                        <p>
                            В цьому розділі ми ставимо наголос на двох цінностях, які вже були названі в попередніх
                            розділах:
                        </p>
                        <ol>
                            <li>Свобода вибору людини, яка надана їй Творцем в акті створення її особистості за образом
                                Божим.
                            </li>
                            <li>Любов, яка є вищою цінністю, що поєднує людей, один з одним, і їх усіх з Богом. Вона є
                                виключно
                                Божим даром. При цьому ми маємо бути свідомі того, що для поєднання людей в любові є
                                умова –
                                люди мають стати однодумцями і єдиновірцями.
                            </li>
                        </ol>
                    </section>
                    <section id="achieving_goals" className="scroll-mt-40">
                        <h3>Порядок і способи досягнення цілей</h3>
                        <p>
                            Ідея проєкту була запропонована Благодійним фондом «МедіаГлагол» (МГ), який був
                            зареєстрований в
                            Україні у 2014 році. Основними напрямками діяльності фонду МГ є організація і підтримка
                            християнських освітніх програм, а також проєктів з вивчення Біблії. Співробітники фонду МГ
                            мають
                            багаторічний досвід релігійно-просвітницької діяльності, що розпочалася до його офіційної
                            реєстрації, ще за часів комуністичної влади. Ця діяльність посприяла створенню навколо МГ
                            груп
                            спеціалістів і волонтерів, зусиллями яких, при умові виділення грантів на оплату праці
                            спеціалістів,
                            закупівлю необхідних технічних засобів і програмного забезпечення, можуть бути виконані
                            наступні
                            роботи:
                        </p>
                        <ol>
                            <li>Створення переліку конкретних джерел кожного типу у формі таблиці, що включаються в ІПП.
                                На
                                початковому етапі буде обмежено перелік мов джерел, що додаються. Таблиця має включати
                                всю
                                необхідну інформацію про джерело, що забезпечить його якісну обробку при розміщенні в
                                ІПП і
                                комфортне використання в процесі функціонування у штатному режимі. Більш детальна
                                інформація з
                                наповнення таблиці буде описана в окремому документі.
                            </li>
                            <li>Розв’язання проблеми зберігання значних об’ємів даних в хмарних сховищах і швидкого
                                доступу до
                                них в процесі експлуатації проєкту.
                            </li>
                            <li>Визначення структури бази даних, алгоритмізація обробки джерел, визначених в таблиці
                                (дивись
                                п.1), і формування ІПП. При цьому, для встановлення взаємних посилань між джерелами ІПП,
                                а також
                                створення відсутніх в них анотацій, можуть бути використані застосунки з ШІ, які мають
                                бути
                                натреновані на джерелах, включених в ІПП.
                            </li>
                            <li>Розробка технічного завдання і програмного інтерфейсу користувача на його основі.
                            </li>
                            <li>Розробка сайту проєкту.</li>
                            <li>Тестування проєкту і його запуск в пробну експлуатацію.</li>
                            <li>Створення відео та опису з використання готового продукту для його розповсюдження в
                                соцмережах,
                                наукових та навчальних закладах, релігійних громадах та інших організаціях.
                            </li>
                        </ol>
                    </section>
                    <section id="prop_impl" className="scroll-mt-40">
                        <p className="font-bold mb-8 text-center mt-8">Основні властивості та особливості реалізації</p>
                    </section>

                    <section id="exp_impl" className="scroll-mt-40">
                        <p className="font-bold mb-8 text-center">Очікувані результати реалізації</p>
                    </section>
                    <section id="plan" className="scroll-mt-40">
                        <p className="font-bold mb-4 text-center">Орієнтовний план виконання</p>

                        <div className="max-w-7xl mx-auto">
                            <table className="min-w-full table-auto border-collapse border border-slate-400">
                                <thead>
                                <tr>
                                    <th className="border border-slate-300">№</th>
                                    <th className="border border-slate-300">Види робіт</th>
                                    <th className="border border-slate-300">Виконавці</th>
                                    <th className="border border-slate-300">Строк виконання</th>
                                    <th className="border border-slate-300">Нотатки</th>
                                </tr>
                                </thead>
                                <tbody>
                                <tr>
                                    <td className="border border-slate-300 text-center">1</td>
                                    <td className="border border-slate-300"></td>
                                    <td className="border border-slate-300"></td>
                                    <td className="border border-slate-300"></td>
                                    <td className="border border-slate-300"></td>
                                </tr>
                                <tr>
                                    <td className="border border-slate-300 text-center">2</td>

                                    <td className="border border-slate-300"></td>
                                    <td className="border border-slate-300"></td>
                                    <td className="border border-slate-300"></td>
                                    <td className="border border-slate-300"></td>
                                </tr>
                                <tr>
                                    <td className="border border-slate-300 text-center">3</td>
                                    <td className="border border-slate-300"></td>
                                    <td className="border border-slate-300"></td>
                                    <td className="border border-slate-300"></td>
                                    <td className="border border-slate-300"></td>
                                </tr>
                                <tr>
                                    <td className="border border-slate-300 text-center">4</td>

                                    <td className="border border-slate-300"></td>
                                    <td className="border border-slate-300"></td>
                                    <td className="border border-slate-300"></td>
                                    <td className="border border-slate-300"></td>
                                </tr>
                                <tr>
                                    <td className="border border-slate-300 text-center">5</td>

                                    <td className="border border-slate-300"></td>
                                    <td className="border border-slate-300"></td>
                                    <td className="border border-slate-300"></td>
                                    <td className="border border-slate-300"></td>
                                </tr>
                                <tr>
                                    <td className="border border-slate-300 text-center">6</td>
                                    <td className="border border-slate-300"></td>
                                    <td className="border border-slate-300"></td>
                                    <td className="border border-slate-300"></td>
                                    <td className="border border-slate-300"></td>
                                </tr>
                                <tr>
                                    <td className="border border-slate-300 text-center">7</td>
                                    <td className="border border-slate-300"></td>
                                    <td className="border border-slate-300"></td>
                                    <td className="border border-slate-300"></td>
                                    <td className="border border-slate-300"></td>
                                </tr>
                                </tbody>
                            </table>
                        </div>
                    </section>
                    <section id="budget" className="scroll-mt-40">
                        <p className="font-bold mb-8 text-center mt-10">Бюджет проєкту</p>
                    </section>
                </main>
            </div>
    );
}

export default AboutUsPage;
