import { BackButton } from "@/components/back-button";

const AboutUsPage = () => {
    return (
        <div>
            <BackButton/>
            <h1>Про нас</h1>
            <p>На цій сторінці має бути красивий текст, в якому розповідається про те, хто ми, і, мабудь, про мету створення проєкту. Але гарний текст на цю тему я не написала, тому зараз ви бачите саме цей текст, метою якого є заповнення вільного простору. Окрім гарно написаного тексту, ця сторінка ще має бути гарно оформлена, що теж поки що не зроблено. Якось так</p>
        </div>
    )
}

export default AboutUsPage;