"use client";

import { Link } from "@/i18n/routing";
import { useTranslations } from "next-intl";
import History from "@/components/history";
import { ChevronFirst, ChevronLast } from "lucide-react";
import { About } from "@/components/about";
import { useState } from "react";

export default function LewisPage() {
    const t = useTranslations("BookContents");

    const [expanded, setExpanded] = useState(true);
    const [showContent, setShowContent] = useState(false);
    
    return (
        <div className="h-min-full flex mt-16">
                                <div className="flex">
                        <div className="relative">
                            <button onClick={() => setExpanded(curr => !curr)}
                                    className={`absolute top-4 z-20 hover:bg-blue-200 ${expanded ? "left-56 dark:bg-secondary dark:hover:bg-blue-200" : "left-4 dark:bg-background dark:hover:bg-blue-200"} hidden md:block p-1.5 rounded-lg dark:color-white`}>
                                {expanded ? <ChevronFirst /> : <ChevronLast/>}
                            </button>
                        </div>
                        <div
                            className={`hidden h-screen w-72 min-w-72 overflow-y-auto bg-secondary shadow-lg ${
                                expanded ? "md:block" : "initial"
                            }`}>
                            <div>
                            <About/>
                                 
                                 <div className="bg-secondary px-6 pt-1 pb-8">
                                     <div className="py-2 flex justify-between font-medium">
                                         <button className={`w-1/2 ${showContent ? "" : "border-b-2 border-blue-500 text-blue-500"}`}  
                                             onClick={() => {setShowContent(false)}}>
                                                 {t('navigator')}
                                         </button>
                                         <button className={`w-1/2 ${showContent ? "border-b-2 border-blue-500 text-blue-500" : ""}`} 
                                             onClick={() => {setShowContent(true)}}>
                                                 {t('content')}
                                         </button>
                                     </div>
             
                                 {showContent ? 
                                 <ul className="list-none bg-secondary pl-0">
                                     <li>
                                         <Link href='/library/lewis/#section1' 
                                             className="block py-2 rounded-lg hover:bg-blue-200 dark:hover:text-stone-800 transition-colors duration-200">
                                             Лист I
                                         </Link>
                                         <li>
                                         <Link href='/library/lewis/#section2' 
                                             className="block py-2 rounded-lg hover:bg-blue-200 dark:hover:text-stone-800 transition-colors duration-200">
                                             Лист II
                                         </Link>
                                     </li>
                                     </li> 
                                 </ul> :
                                 <History />}    
                             </div>   
                            </div>
                        </div>
                    </div>

                    <div className=" p-10  py-8 px-4  w-full mx-auto min-h-screen">
                        <h2>Листи крутеня К.С. Люїc</h2>
                        <section id="section1">
                            <h3>Лист I</h3>
                            <p>Мій любий Шашеню!</p>
                            <p>Спинюсь на твоїх словах про те, як ти спрямовуєш навчання свого підопічного і як турбуєшся, щоб він більше перебував у товаристві свого приятеля-мате-ріаліста. Чи не здається тобі, що ти трохи наївніший? Скидається на те, що ти вважаєш, ніби за допомогою доказів його можна було б відвернути від Ворога. Я б погодився з цим, якби він жив кілька століть тому. Тоді людські істоти ще добре усвідомлювали, коли те чи інше твердження доведене, а коли ні; і якщо воно було доведене, люди справді вірили в це, Тоді вони ще узгоджували мислення з діями і були готові змінити свій спосіб життя внаслідок роздумів, міркувань та висновків. Але за допомогою тижневої преси та інших засобів ми великою мірою змінили становите. Твій підопічний із самого дитинства звик мати справу з десятками несумісних філософських концепцій, які всі водночас нуртують в його голові. Він сприймає кожне вчення не як «правильне» чи «хибне», а як «академічне» чи «практичне», «застаріле» чи «сучасне», «гуманне» чи «жорстоке». Термінологія і спосіб викладу, а не докази, допоможуть тобі відвернути його від церкви. Не гай часу на переконування його в тому, що матеріалізм - це істина! Переконай його, що матеріалізм - сильний, міцний, наступальний, тобто, що це філософія майбутнього. Саме цього потребує твій підопічний.</p>
                            <p>Шукати докази - означає перенести битву на терени Ворога. Він також може обґрунтовувати, проте я вважаю, що в практичній пропаганді Ворог протягом століть завжди був позаду Нашого Отця Пекла. Вже сам процес наведення доказів пробуджує розум твого підопічного, а якщо розум не спить, то наслідки передбачити неможливо. Навіть якщо й викривити якусь послідовність думки на нашу користь, у твого підопічного однаково посилиться фатальна звичка зосереджуватись на глобальних питаннях і відвертати свою увагу бід потоку скороминущих почуттів. Твоє завдання полягає в тому, щоб прикувати його увагу саме до цього потоку. Привчи підопічного називати це «справжнім життям» і не дозволяй йому питати себе, що таке «справжнє».</p>
                            <p>Пам&aposятай, що він, на відміну від тебе, не чистий дух. Ніколи не бувши людиною (о, ця огидна перевага Ворога!), ти не здатен зрозуміти як вони піддаються тискові буденності. Якось я мав підопічного - переконаного атеїста, який любив ходити до Британського музею. Одного разу, коли він сидів за книжкою, я помітив, що його думки попливли в хибному напрямку. Ворог, ясна річ, був у той час біля нього. Я побачив, що моя двадцятирічна праця опинилася під загрозою. Якби я тоді розгубився і вдався до доказів, то, безумовно, зазнав би поразки. Але я не зробив тієї дурниці, а посилив свій вплив на ту частину свого підопічного, яка найбільше була під моїм контролем, і навіяв йому думку, що вже час обідати. Ворог очевидячки навіював моєму підопічному протилежну думку (ти знаєш, що людина ніколи не чує всього, що Він їй каже?), що речі, над якими той працює, важливіші, ніж обід. Принаймні мені здається, що тієї миті Він діяв саме так, бо коли я сказав: «Досить мізкувати над цим. Краще повернутися до роботи після обіду», - підопічний значно повеселішав, а коли я додав: «На свіжу голову воно піде краще», - той уже прямував до дверей. Як тільки він опинився на вулиці, битва була виграна. Я вказав йому на хлопчика-газе-тяра, який закликав купувати газети, а тоді звернув його увагу на автобус №73, який проїжджав вулицею, і перш ніж мій .підопічний зійшов зі сходів бібліотеки, я переконав його в тому, шо хоч би які дивні думки не з’явилялися в людини, коли вона зачинившись працює над книжками, певна доза «справжнього життя» (автобус і хлопчик-газетяр) неодмінно поверне її до дійсності і покаже, що «оті речі» в книжках не можуть бути правдивими. Підопічний запам&aposятав цей випадок і впродовж багато років любив говорити про «те невиразне відчуття реальності, яке є нашою надійною охороною проти відхилень від простої логіки». Тепер він у безпеці в оселі Нашого Отця.</p>
                            <p>Ти розумієш суть того, про що я кажу? Завдяки процесам, які ми започаткували в людях багато сторіч тому, вони ніяк не можуть повірити у незвичне й незнайоме тоді, коли звичне й знайоме у них перед очима. Вказуй йому на буденність речей. Найголовніше, ні в якому разі не вдавайся до науки (я маю на увазі справжню науку) як до захисту від християнства. Наука заохотить твого підопічного думати про реальності, яких він не може відчути на дотик або побачити. Ми є маємо прикрі випадки серед сучасних фізиків. Якщо йому хочеться копирсатися в науці, зосередь ного зусилля на економіці й соціології і не дозволяй відриватися від неоціненного «реального життя». Та найкраще було б, якби ти взагалі відірвав підопічного од читання наукових праць; натомість його можна заохотити якоюсь великою загальною ідеєю, і тоді все, що зустрінеться у книжках чи в розмовах, він сприйматиме як «наслідки сучасних досліджень». Пам&aposятай, що твоє завдання - дурманити його. Ви, молоді дияволята, повинні говорити так, щоб усі думали, що ви проповідуєте істину!</p>
                            <p>З прихильністю твій дядько Крутень.</p>
                        </section>

                        <section id="section2">
                            <h3>Лист II</h3>
                            <p>Мій любий Шашеню!</p>
                        </section>

                    </div>
        </div>
    )
}