// pages/single-single-page.tsx
"use client";

const BiblePage = () => {
    return (
        <div className="py-8 px-4 w-full h-40vh overflow-y-auto">
            <h2>Ветхий Завет - Бытие - Глава 1</h2>
            <div>
                <p>1. В начале сотворил Бог небо и землю.</p>
                <p>2. Земля же была безвидна и пуста, и тьма над бездною, и Дух Божий носился над водою.</p>
                <p>3. И сказал Бог: да будет свет. И стал свет.</p>
                <p>4. И увидел Бог свет, что он хорош, и отделил Бог свет от тьмы.</p>
                <p>5. И назвал Бог свет днем, а тьму ночью. И был вечер, и было утро: день один.</p>
                <p>6. И сказал Бог: да будет твердь посреди воды, и да отделяет она воду от воды. [И стало
                    так.]</p>
                <p>7. И создал Бог твердь, и отделил воду, которая под твердью, от воды, которая над твердью. И
                    стало так.</p>
                <p>8. И назвал Бог твердь небом. [И увидел Бог, что это хорошо.] И был вечер, и было утро: день
                    второй.</p>
                <p>9. И сказал Бог: да соберется вода, которая под небом, в одно место, и да явится суша. И
                    стало так. [И собралась вода под небом в свои места, и явилась суша.]</p>
                <p>10. И назвал Бог сушу землею, а собрание вод назвал морями. И увидел Бог, что это хорошо.</p>
                <p>11. И сказал Бог: да произрастит земля зелень, траву, сеющую семя [по роду и по подобию ее,
                    и] дерево плодовитое, приносящее по роду своему плод, в котором семя его на земле. И стало
                    так.</p>
                <p>12. И произвела земля зелень, траву, сеющую семя по роду [и по подобию] ее, и дерево
                    [плодовитое], приносящее плод, в котором семя его по роду его [на земле]. И увидел Бог, что
                    это хорошо.</p>
                <p>13. И был вечер, и было утро: день третий.</p>
                <p>14. И сказал Бог: да будут светила на тверди небесной [для освещения земли и] для отделения
                    дня от ночи, и для знамений, и времен, и дней, и годов;</p>
                <p>15. и да будут они светильниками на тверди небесной, чтобы светить на землю. И стало так.</p>
                <p>16. И создал Бог два светила великие: светило большее, для управления днем, и светило
                    меньшее, для управления ночью, и звезды;</p>
                <p>17. и поставил их Бог на тверди небесной, чтобы светить на землю,</p>
                <p>18. и управлять днем и ночью, и отделять свет от тьмы. И увидел Бог, что это хорошо.</p>
                <p>19. И был вечер, и было утро: день четвёртый.</p>
                <p>20. И сказал Бог: да произведет вода пресмыкающихся, душу живую; и птицы да полетят над
                    землею, по тверди небесной. [И стало так.]</p>
                <p>21. И сотворил Бог рыб больших и всякую душу животных пресмыкающихся, которых произвела вода,
                    по роду их, и всякую птицу пернатую по роду ее. И увидел Бог, что это хорошо.</p>
                <p>22. И благословил их Бог, говоря: плодитесь и размножайтесь, и наполняйте воды в морях, и
                    птицы да размножаются на земле.</p>
                <p>23. И был вечер, и было утро: день пятый.</p>
                <p>24. И сказал Бог: да произведет земля душу живую по роду ее, скотов, и гадов, и зверей земных
                    по роду их. И стало так.</p>
                <p>25. И создал Бог зверей земных по роду их, и скот по роду его, и всех гадов земных по роду
                    их. И увидел Бог, что это хорошо.</p>
                <p>26. И сказал Бог: сотворим человека по образу Нашему [и] по подобию Нашему, и да
                    владычествуют они над рыбами морскими, и над птицами небесными, [и над зверями,] и над
                    скотом, и над всею землею, и над всеми гадами, пресмыкающимися по земле.</p>
                <p>27. И сотворил Бог человека по образу Своему, по образу Божию сотворил его; мужчину и женщину
                    сотворил их.</p>
                <p>28. И благословил их Бог, и сказал им Бог: плодитесь и размножайтесь, и наполняйте землю, и
                    обладайте ею, и владычествуйте над рыбами морскими [и над зверями,] и над птицами небесными,
                    [и над всяким скотом, и над всею землею,] и над всяким животным, пресмыкающимся по
                    земле.</p>
                <p>29. И сказал Бог: вот, Я дал вам всякую траву, сеющую семя, какая есть на всей земле, и
                    всякое дерево, у которого плод древесный, сеющий семя; — вам сие будет в пищу;</p>
                <p>30. а всем зверям земным, и всем птицам небесным, и всякому [гаду,] пресмыкающемуся по земле,
                    в котором душа живая, дал Я всю зелень травную в пищу. И стало так.</p>
                <p>31. И увидел Бог все, что Он создал, и вот, хорошо весьма. И был вечер, и было утро: день
                    шестой.</p>
            </div>

        </div>
    );
}

export default BiblePage;
