"use client";
 
 import { useTranslations } from "next-intl";
 import { useState, useEffect, useRef } from "react";
 import { useNavigation } from "@/lib/navigation-context";
 import { BOOKS_DATA } from "@/books-data_for-del";
 import FontSizeControls from "@/components/FontSizeControls";
 
 export default function RomansPage() {
    const t = useTranslations("BookContents");

    const { addBookToHistory } = useNavigation();
    const currentBookLink = "/library/bible/romans";
    const romans1132Ref = useRef<HTMLParagraphElement>(null);
    // const [isHighlighted, setIsHighlighted] = useState(false);
    const [bookContent, setBookContent] = useState<any>(null);

    useEffect(() => {
          if (!bookContent) { 
      const foundBook = BOOKS_DATA.find(item => item.link === currentBookLink);

      if (foundBook) {
        setBookContent(foundBook);
        addBookToHistory(foundBook.id);
      } else {
        setBookContent(null);
      }
    }

  const url = new URL(window.location.href);
  const hash = url.hash;
  const shouldScrollToSection = hash.includes('#romans-11-32') && hash.includes('scroll=true');

  if (shouldScrollToSection) {
    // setIsHighlighted(true); 
    // setTimeout(() => {
    //   setIsHighlighted(false);
    // }, 4000);

          if (romans1132Ref.current) {
        romans1132Ref.current.scrollIntoView({
          behavior: 'smooth', 
          block: 'start',   
        });
      }
  } 
  // else {
  //   setIsHighlighted(false);
  // }
}, [bookContent, addBookToHistory, currentBookLink]); 

        if (!bookContent) {
    return <div>{t("loading")}</div>;
  }

     return (
        <div className="h-min-full flex">       
         
                     <div className="relative h-full w-full px-4 pt-2 block">
                                       <div className="absolute opacity-0">
                                        <FontSizeControls targetId='book-romans-font'/>
                                       </div>
              
  <div id="book-romans-font" className="w-full">
    <h2 className="pt-0">Послання до Римлян (Переклад І. Огієнка)</h2>
    <section id="section1" className="mx-auto w-4/5 md:w-3/5 lg:w-1/2 mb-2 px-2 border border-gray-300 rounded-md">
      <h2>Розділ 11</h2>
      <p>1. Отож я питаю: Чи ж Бог відкинув народа Свого? Зовсім ні! Бо й я ізраїльтянин, із насіння Авраамового, Веніяминового племени.</p>
      <p>2. Не відкинув Бог народа Свого, що його перше знав. Чи ви не знаєте, що говорить Писання, де про Іллю, як він скаржиться Богові на Ізраїля, кажучи:</p>
      <p>3. Господи, вони повбивали пророків Твоїх, і Твої жертівники поруйнували, і лишився я сам, і шукають моєї душі.</p>
      <p>4. Та що каже йому Божа відповідь: Я для Себе зоставив сім тисяч мужа, що перед Ваалом колін не схилили.</p>
      <p>5. Також і теперішнього часу залишився останок за вибором благодаті.</p>
      <p>6. А коли за благодаттю, то не з учинків, інакше благодать не була б благодаттю. А коли з учинків, то це більше не благодать, інакше вчинок не є вже вчинок.</p>
      <p>7. Що ж? Чого Ізраїль шукає, того не одержав, та одержали вибрані, а останні затверділи,</p>
      <p>8. як написано: Бог дав їм духа засипання, очі, щоб не бачили, і вуха, щоб не чули, аж до сьогоднішнього дня.</p>
      <p>9. А Давид каже: Нехай станеться стіл їхній за сітку й за пастку, і на спокусу, та їм на заплату;</p>
      <p>10. нехай потемніють їхні очі, щоб не бачили, хай назавжди зігнеться хребет їхній!</p>
      <p>11. Тож питаю: Чи ж спіткнулись вони, щоб упасти? Зовсім ні! Але з їхнього занепаду спасіння поганам, щоб викликати заздрість у них.</p>
      <p>12. А коли їхній занепад багатство для світу, а їхнє упокорення багатство поганам, скільки ж більш повнота їхня?</p>
      <p>13. Кажу бо я вам, поганам: через те, що я апостол поганів, я хвалю свою службу,</p>
      <p>14. може як викличу заздрість у своїх за тілом, і спасу декого з них.</p>
      <p>15. Коли ж відкинення їх то примирення світу, то що їхнє прийняття, як не життя з мертвих?</p>
      <p>16. А коли святий первісток, то й тісто святе; а коли святий корінь, то й віття святе.</p>
      <p>17. Коли ж деякі з галузок відломилися, а ти, бувши дике оливне дерево, прищепився між них і став спільником товщу оливного кореня,</p>
      <p>18. то не вихваляйся перед галузками; а коли вихваляєшся, то знай, що не ти носиш кореня, але корінь тебе.</p>
      <p>19. Отже скажеш: Галузки відломилися, щоб я прищепився.</p>
      <p>20. Добре. Вони відломились невірством, а ти тримаєшся вірою; не величайся, але бійся.</p>
      <p>21. Бо коли Бог природних галузок не пожалував, то Він і тебе не пожалує!</p>
      <p>22. Отже, бач добрість і суворість Божу, на відпалих суворість, а на тебе добрість Божа, коли перебудеш у добрості, коли ж ні, то й ти будеш відтятий.</p>
      <p>23. Та й вони, коли не зостануться в невірстві, прищепляться, бо має Бог силу їх знов прищепити.</p>
      <p>24. Бо коли ти відтятий з оливки, дикої з природи, і проти природи защеплений до доброї оливки, то скільки ж більше ті, що природні, прищепляться до своєї власної оливки?</p>
      <p>25. Бо не хочу я, браття, щоб ви не знали цієї таємниці, щоб не були ви високої думки про себе, що жорстокість сталась Ізраїлеві почасти, аж поки не ввійде повне число поган,</p>
      <p>26. і так увесь Ізраїль спасеться, як написано: Прийде з Сіону Спаситель, і відверне безбожність від Якова,</p>
      <p>27. і це заповіт їм від Мене, коли відійму гріхи їхні!</p>
      <p>28. Тож вони за Євангелією вороги ради вас, а за вибором улюблені ради отців.</p>
      <p>29. Бо дари й покликання Божі невідмінні.</p>
      <p>30. Бо як і ви були колись неслухняні Богові, а тепер помилувані через їхній непослух,</p>
      <p>31. так і вони тепер спротивились для помилування вас, щоб і самі були помилувані.</p>
      {/* <p id="romans-11-32" ref={romans1132Ref} className={isHighlighted ? 'text-primary ': ''}>
        32. Бо замкнув Бог усіх у непослух, щоб помилувати всіх.</p>
      <p className={isHighlighted ? 'text-primary ': ''}>33. О глибино багатства, і премудрости, і знання Божого! Які недовідомі присуди Його, і недосліджені дороги Його!</p>
      <p className={isHighlighted ? 'text-primary ': ''}>34. Бо хто розум Господній пізнав? Або хто був дорадник Йому?</p>
      <p className={isHighlighted ? 'text-primary ': ''}>35. Або хто давніш Йому дав, і йому буде віддано?</p>
      <p className={isHighlighted ? 'text-primary ': ''}>36. Бо все з Нього, через Нього і для Нього! Йому слава навіки. Амінь.</p> */}
            <p id="romans-11-32" ref={romans1132Ref}>
        32. Бо замкнув Бог усіх у непослух, щоб помилувати всіх.</p>
      <p>33. О глибино багатства, і премудрости, і знання Божого! Які недовідомі присуди Його, і недосліджені дороги Його!</p>
      <p>34. Бо хто розум Господній пізнав? Або хто був дорадник Йому?</p>
      <p>35. Або хто давніш Йому дав, і йому буде віддано?</p>
      <p>36. Бо все з Нього, через Нього і для Нього! Йому слава навіки. Амінь.</p>
    </section>

    <section id="section2" className="mx-auto w-4/5 md:w-3/5 lg:w-1/2 px-2 border border-gray-300 rounded-md">
      <h2>Розділ 12</h2>
      <p>1. Тож благаю вас, браття, через Боже милосердя, повіддавайте ваші тіла на жертву живу, святу, приємну Богові, як розумну службу вашу,</p>
      <p>2. і не стосуйтесь до віку цього, але перемініться відновою вашого розуму, щоб пізнати вам, що то є воля Божа, добро, приємність та досконалість.</p>
      <p>3. Через дану мені благодать кажу кожному з вас не думати про себе більш, ніж належить думати, але думати скромно, у міру віри, як кожному Бог наділив.</p>
      <p>4. Бо як в однім тілі маємо багато членів, а всі члени мають не однакове діяння,</p>
      <p>5. так багато нас є одне тіло в Христі, а зосібна ми один одному члени.</p>
      <p>6. І ми маємо різні дари, згідно з благодаттю, даною нам: коли пророцтво то виконуй його в міру віри,</p>
      <p>7. а коли служіння будь на служіння, коли вчитель на навчання,</p>
      <p>8. коли втішитель на потішання, хто подає у простоті, хто головує то з пильністю, хто милосердствує то з привітністю!</p>
      <p>9. Любов нехай буде нелицемірна; ненавидьте зло та туліться до доброго!</p>
      <p>10. Любіть один одного братньою любов&apos;ю; випереджайте один одного пошаною!</p>
      <p>11. У ревності не лінуйтеся, духом палайте, служіть Господеві,</p>
      <p>12. тіштесь надією, утиски терпіть, перебувайте в молитві,</p>
      <p>13. беріть уділ у потребах святих, будьте гостинні до чужинців!</p>
      <p>14. Благословляйте тих, хто вас переслідує; благословляйте, а не проклинайте!</p>
      <p>15. Тіштеся з тими, хто тішиться, і плачте з отими, хто плаче!</p>
      <p>16. Думайте між собою однаково; не величайтеся, але наслідуйте слухняних; не вважайте за мудрих себе!</p>
      <p>17. Не платіть нікому злом за зло, дбайте про добре перед усіма людьми!</p>
      <p>18. Коли можливо, якщо це залежить від вас, живіть у мирі зо всіма людьми!</p>
      <p>19. Не мстіться самі, улюблені, але дайте місце гніву Божому, бо написано: Мені помста належить, Я відплачу, говорить Господь.</p>
      <p>20. Отож, як твій ворог голодний, нагодуй його; як він прагне, напій його, бо, роблячи це, ти згортаєш розпалене вугілля йому на голову.</p>
      <p>21. Не будь переможений злом, але перемагай зло добром!</p>
    </section>
  </div>
</div>
         </div>  
         );
         }