"use client";

import { useState, useEffect } from "react";
import {CircleX } from "lucide-react";
import { useTranslations } from "next-intl";
import { useNavigation } from "@/lib/navigation-context";
import { BOOKS_DATA } from "@/books-data_for-del";

const BibleUaPage = () => {
    const t = useTranslations("BookContents");

    const { addBookToHistory } = useNavigation();
    const currentBookLink = "/library/bible/bible-ua";
    const [showPage, setShowPage] = useState(true);
    const [bookContent, setBookContent] = useState<any>(null);

    useEffect(() => {
    if (!bookContent) { 
      const foundBook = BOOKS_DATA.find(item => item.link === currentBookLink);

      if (foundBook) {
        setBookContent(foundBook);
        addBookToHistory(foundBook.id);
      } else {
        setBookContent(null);
      }
    }
       }, [bookContent, addBookToHistory, currentBookLink])

      if (!bookContent) {
        return <div>{t("loading")}</div>; }

    return (
        <div className="h-min-full flex">
                     <div className="relative md:flex h-full w-full px-4 pt-2">
                        <div className={`relative ${showPage ? "mb-3 md:mb-0 md:w-1/2 h-40vh md:h-screen overflow-y-scroll" : "w-full"}`}>
                            <h2>Український переклад Біблії І. Огієнка</h2>
                            <h3 className="text-2xl">Книга Буття</h3>
                            <section id="section1">
                                <h3>Глава 1</h3>
                                <p>1. На початку Бог створив Небо та землю.</p>
                                <p>2. А земля була пуста та порожня, і темрява була над безоднею, і Дух Божий ширяв над поверхнею води.</p>
                                <p>3. І сказав Бог: Хай станеться світло! І сталося світло.</p>
                                <p>4. І побачив Бог світло, що добре воно, і Бог відділив світло від темряви.</p>
                                <p>5. І Бог назвав світло: День, а темряву назвав: Ніч. І був вечір, і був ранок, день перший.</p>
                                <p>6. І сказав Бог: Нехай станеться твердь посеред води, і нехай відділяє вона між водою й водою.</p>
                                <p>7. І Бог твердь учинив, і відділив воду, що під твердю вона, і воду, що над твердю вона. І сталося так.</p>
                                <p>8. І назвав Бог твердь Небо. І був вечір, і був ранок день другий.</p>
                                <p>9. І сказав Бог: Нехай збереться вода з-попід неба до місця одного, і нехай суходіл стане видний. І сталося так.</p>
                                <p>10. І назвав Бог суходіл: Земля, а місце зібрання води назвав: Море. І Бог побачив, що добре воно.</p>
                                <p>11. І сказав Бог: Нехай земля вродить траву, ярину, що насіння вона розсіває, дерево овочеве, що за родом своїм плід приносить, що в ньому насіння його на землі. І сталося так.</p>
                                <p>12. І земля траву видала, ярину, що насіння розсіває за родом її, і дерево, що приносить плід, що насіння його в нім за родом його. І Бог побачив, що добре воно.</p>
                                <p>13. І був вечір, і був ранок, день третій.</p>
                                <p>14. І сказав Бог: Нехай будуть світила на тверді небесній для відділення дня від ночі, і нехай вони стануть знаками, і часами умовленими, і днями, і роками.</p>
                                <p>15. І нехай вони стануть на тверді небесній світилами, щоб світити над землею. І сталося так.</p>
                                <p>16. І вчинив Бог обидва світила великі, світило велике, щоб воно керувало днем, і світило мале, щоб керувало ніччю, також зорі.</p>
                                <p>17. І Бог умістив їх на тверді небесній, щоб світили вони над землею,</p>
                                <p>18. і щоб керували днем та ніччю, і щоб відділювали світло від темряви. І Бог побачив, що це добре.</p>
                                <p>19. І був вечір, і був ранок, день четвертий.</p>
                                <p>20. І сказав Бог: Нехай вода вироїть дрібні істоти, душу живу, і птаство, що літає над землею під небесною твердю.</p>
                                <p>21. І створив Бог риби великі, і всяку душу живу плазуючу, що її вода вироїла за їх родом, і всяку пташину крилату за родом її. І Бог побачив, що добре воно.</p>
                                <p>22. І поблагословив їх Бог, кажучи: Плодіться й розмножуйтеся, і наповнюйте воду в морях, а птаство нехай розмножується на землі!</p>
                                <p>23. І був вечір, і був ранок, день п&#34;ятий.</p>
                                <p>24. І сказав Бог: Нехай видасть земля живу душу за родом її, худобу й плазуюче, і земну звірину за родом її. І сталося так.</p>
                                <p>25. І вчинив Бог земну звірину за родом її, і худобу за родом її, і все земне плазуюче за родом його. І бачив Бог, що добре воно.</p>
                                <p>26. І сказав Бог: Створімо людину за образом Нашим, за подобою Нашою, і хай панують над морською рибою, і над птаством небесним, і над худобою, і над усею землею, і над усім плазуючим, що плазує по землі.</p>
                                <p>27. І Бог на Свій образ людину створив, на образ Божий її Він створив, як чоловіка та жінку створив їх.</p>
                                <p>28. І поблагословив їх Бог, і сказав Бог до них: Плодіться й розмножуйтеся, і наповнюйте землю, оволодійте нею, і пануйте над морськими рибами, і над птаством небесним, і над кожним плазуючим живим на землі!</p>
                                <p>29. І сказав Бог: Оце дав Я вам усю ярину, що розсіває насіння, що на всій землі, і кожне дерево, що на ньому плід деревний, що воно розсіває насіння, нехай буде на їжу це вам!</p>
                                <p>30. І земній усій звірині і всьому птаству небесному, і кожному, що плазує по землі, що душа в ньому жива, уся зелень яринна на їжу для них. І сталоск.</p>
                                <p>31. І побачив Бог усе, що вчинив. І ото, вельми добре воно! І був вечір, і був ранок, день шостий.</p>
                            </section>

                            <section id="section2" className="">
                                <h3>Глава 2</h3>
                                <p>1. І були скінчені небо й земля, і все воїнство їхнє.</p>
                                <p>2. І скінчив Бог дня сьомого працю Свою, яку Він чинив. І Він відпочив у дні сьомім
                                    від усієї праці Своєї, яку був чинив.</p>
                                <p>3. І поблагословив Бог день сьомий, і його освятив, бо в нім відпочив Він від усієї
                                    праці Своєї, яку, чинячи, Бог був створив</p>
                            </section>

                            {!showPage &&
                                <button
                                    className="fixed top-3/4 md:top-32 right-5 md:right-10 bg-primary text-primary-foreground px-6 py-2 rounded-full hover:bg-primary-dark transition duration-300"
                                    onClick={() => {
                                        setShowPage(true)
                                    }}>
                                    Тлумачення
                                </button>}
                        </div>

                         {showPage &&
                        <div className="md:w-1/2 h-40vh md:h-screen px-4 overflow-y-scroll">
                            <button className="fixed right-5 md:right-16 text-gray-700 hover:text-primary-dark transition-colors duration-200" 
                                onClick={() => {setShowPage(false)}}>
                                <CircleX/>
                            </button>
                            <h2>Тлумачення О.Лопухіна на книгу Буття</h2>
                            <h3>Глава 1</h3>
                            <p>1. На початку... Як у святих Отців, так і в усій подальшій тлумачній літературі існують два головних типових тлумачення цього слова. На панівну думку одних - це проста хронологічна вказівка «на початок творіння видимих речей» (Єфрем Сирин), тобто всього того, історія поступового утворення чого викладається безпосередньо далі. За алегоричним же тлумаченням інших (Феоф. Ант., Оріген, Амвросій, Августин та ін.), слово «на початку» має тут індивідуальний сенс, укладаючи в собі прикриту вказівку на одвічне народження від Отця другої Іпостасі Святої Трійці - Сина Божого, у Котрому й через Котрого було звершено все творіння (Ін 1:3); (Кол 1:16). Біблійні паралелі, що відносяться сюди, дають право об&rsquoєднувати обидва цих тлумачення, тобто як знаходити тут вказівку на думку про співвітчизне Отцеві народження Сина або Логоса і про ідеальне створення в Ньому світу ( (Ін 1:1-3,10); (Ін 8:25); (Пс 83:3); (1Пет 1:20); (Кол 1:16); (Об&rsquoявл. 3: 14), так і ще з більшим правом бачити тут пряму вказівку на зовнішнє здійснення предвічних планів божественної Світобудови на початку часу або, точніше, разом із самим цим часом (Пс 101:26); (Євр 1:10); (Пс 83:12-13); (Пс 135:5-6); (Пс 145:6); Притч 8. 22-23; (Іс 64:4); (Іс 41:4); (Сир 18:1); та ін.). «Створили» - тут ужито слово бара, яке, за загальним віруванням як іудеїв, так і християн, так само як і за всім наступним біблійним вживанням, переважно слугує вираженням ідеї божественного ділання (Бут 1:1); (Бут 2:3-4); (Іс 40:28); (Іс 43:1); (Пс 148:5); (Ісх 34:10); (Чис 16:30); (Ієr 31:22); (Мал 2:10) та ін.) має значення творчої діяльності або створення з нічого (Чис 16:30; (Іс 45:7; (Чис 16:30; (Чис 101:26)); (Єр 3:4); (Євр 11:3) та ін. ), має значення творчої діяльності або створення з нічого (Чис 16:30); (Іс 45:7); (Пс 101:26); (Євр 3:4); (Євр 11:3); (2Мак 7:28) та ін.).Цим самим, отже, спростовуються всі матеріалістичні гіпотези про світ як самобутню сутність і пантеїстичні - про нього як про еманацію або витікання божества, і встановлюється погляд на нього як на діло рук Творця, що покликав увесь світ із небуття до буття волею та силою Своєї божественної всемогутності.«небо і землю...»Небо і земля, як два конкретних протилежних полюси всього Світового глобуса, зазвичай слугують у Біблії позначенням «всього всесвіту» (Пс 101:26); (Іс 65:17); (Єр 33:24); (Зах 5:9). 
                                Крім того, багато хто знаходить тут роздільну вказівку на створення світу видимого і невидимого, або Ангелів (Феоф. Ант., Василій Великий, Феодорит, Оріген, Іоанн Дамаскін та ін.). Підставою останнього тлумачення слугує, по-перше, біблійне вживання слова «небо» як синоніму небожителів, тобто ангелів (3Цар 22:19); (Мт 18:10) тощо), а по-друге, і контекст цієї розповіді приписують лише одній землі, тобто видимому світу (2 вірш). ), а по-друге, і контекст цієї розповіді, в якому подальший хаотичний безлад приписують лише одній землі, тобто видимому світу (2 вірш), чим «небо» відокремлюється від «землі» і навіть нібито протиставляють їй як упорядкований, невидимий гірський світ.Підтвердження цьому можна знаходити як у Старому (Йов 38:4-7), так і особливо Новому Заповіті (Кол 1:16).
                            </p>
                            <p>2. Поняття «землі» мовою Біблії часто обіймає собою всю земну кулю, з включенням сюди і видимого неба як його зовнішньої атмосферної оболонки (Бут 14:19-22); (Пс 32:6). У цьому саме значенні воно вжито і тут, як це очевидно з контексту, за свідченням якого хаотична маса цієї «землі» згодом виділила з себе твердь і воду (Бут 1:7). Слова «безвидна і порожня», якими характеризується первісна маса, містять у собі думку про «темряву, безлад і руйнування» (Іс 40:17); (Іс 45:18); (Єр 4:23-26), тобто дають ідею про стан цілковитого хаосу, у якому елементи майбутнього світла, повітря, повітря, землі, води, а також усі зародки рослинного й тваринного життя не піддавалися ще жодному розрізненню і були начебто перемішані між собою. Найкращою паралеллю до цих слів слугує місце з книги Премудростей Соломона, в якому йдеться про те, що Бог створив світ із «необразної речовини» (Прем 11:18) та (2Пет 3:5) «і темрява над безоднею...» Ця темрява була природним наслідком відсутності світла, яке ще не існувало як окрема самостійна стихія, будучи виділеним з первісного хаосу лише згодом, у перший день тижня творчої діяльності. «Над безоднею» і “над водою”.
                            </p>
                        </div>}

                     </div>
        </div>
    );
}

export default BibleUaPage;
