{
  "Navbar": {
    "library": "Library"
  },
    "Homepage": {
      "result": "No result found for this query",      
      "category": "All",
      "audio": "Audio",
      "video": "Video",
      "texts": "Texts"
    },
    "SearchComponent": {
      "search": "Search and filter",
      "placeholder": "Search...",
      "category": "All",
      "audio": "Audio",
      "video": "Video",
      "science": "Scientific texts",
      "result": "Result 1",
      "descriptions": "Description of result 1"
    },
    "CreateRouteComponent": {
      "title": "Let's create a route to explore the topic together.",
      "content": "To try it, please follow the link below:",
      "register": "Library"
    },
    "Library": {
      "title": "Library",
      "bibliya": "Bible",
      "cloud": "Biblical Tradition Cloud",
      "biblical": "Biblical",
      "patristics": "Patristics",
      "philosophy": "Philosophy and history",
      "dictionaries": "Dictionaries and encyclopedias",
      "literature": "Fiction",
      "theology": "Theology"
    },
    "About": {
      "aboutus": "About Us",
      "howitworks": "How it works"
    },
    "AboutUs": {
      "title": "«World of the Bible» - «Світ Біблії»",
      "subtitle1": "Who are we?",
      "par11": "The «The World of the Bible» project is implemented by the Mediaglagol Charitable Foundation",
      "par12": "a non-profit organization that has existed since 2014 and successfully supports Christian educational activities on a volunteer basis.",
      "par13": "Our new project «The World of the Bible» - is a large-scale online resource that will provide various categories of people with a unique free opportunity to study the Bible and Christian heritage in depth through the innovative integration of modern technologies and multi-format multilingual and multicultural media resources.",
      "par14": "We plan to use artificial intelligence to identify unique hypertextual connections between the Bible and texts from fiction, philosophy, psychology, history, and other Public Domain sources, as well as works by contemporary authors who have agreed to collaborate with the project to show how diverse texts written by humans necessarily gravitate toward a single center of biblical revelation.",
      "par15": "Our project will combine video, audio, and communication platforms to help users absorb biblical narratives and offer unique routes for each user created through an AI guide program.",
      "subtitle2": "Project goal",
      "par21": "Our goal is to create conditions for the free return of members of post-Christian society to Christian spiritual values. In the secular world, where freedom of choice has become the foundation of civilization, we see a vital need to embody biblical truths, which in the past were the basis of moral values.",
      "par22": "The sad experience of the history of the twentieth and early twenty-first centuries, with the multimillion victims of terror and world wars, convinces us that without a free and deep return to Christian principles, societies around the world will inevitably experience moral disorientation, which leads to degradation, wars, violence, and corruption. That is why we are calling for a renewed, conscious look at the Bible.",
      "subtitle3": "Why us?",
      "par31": "«World of the Bible» - is an innovative project that combines modern technology and biblical studies in a unique way. We are creating new opportunities for everyone who wants to learn more about spiritual truths through interaction with various media resources and communication platforms. Thanks to artificial intelligence and personalized research routes, each user can find their own unique spiritual path within our project. The work with the resource takes place in an attractive form of a journey between various texts, video and audio sources, and centers of communication with the help of an AI guide that takes into account the individual preferences of the user.",
      "subtitle4": "Why is it important for sponsors to invest in us?",
      "par41": "Investments in «World of the Bible» support an important cultural and educational initiative that is making a difference in the world by bridging the divide between different Christian communities and cultural backgrounds, reflecting the deep connections between secular and religious cultures.",
      "par42": "Sponsors receive:",
      "receive1": "Visibility among the project's target groups (thanks to all sponsors will be on the website without specifying the amount of the contribution).",
      "receive2": "Opportunity to participate in content creation and organization of cultural and educational events.",
      "receive3": "Collaboration with researchers, writers, and leaders of Christian groups to promote biblical values.",
      "par43": "Your contribution to our project will help to heal society and heal the toxic patterns of its existence through the dissemination of quality Christian values among people in the modern world. Investing in us is an opportunity to be part of a global initiative that seeks to lead people to a deeper understanding and assimilation of spiritual truths."
    },
    "HowItWorks": {
      "title": "How it works",
      "content":"There should be a How It Works page that explains how to use the site. In my opinion, it would be great to add slides that show what the user can do on the site. These slides need to be drawn specifically for this project. Perhaps some kind of video instruction would be appropriate."
    },
    "Footer": {
      "email":"Email us: mediaglagol@gmail.com",
      "facebook": "Follow us on Facebook",
      "telegram": "Subscribe to our Telegram channel"
    }
  }