{
    "Navbar": {
        "library": "Бібліотека"
    },
    "Homepage": {
        "navigator": "Навігатор",
        "result": "За цим запитом не знайдено жодного результату",
        "category": "Всі",
        "audio": "Аудіо",
        "video": "Відео",
        "texts": "Тексти"
    },
    "SearchComponent": {
        "search": "Пошук та фільтр",
        "placeholder": "Пошук...",
        "category": "Всі",
        "audio": "Аудіо",
        "video": "Відео",
        "science": "Наукові тексти",
        "result": "Результат 1",
        "descriptions": "Опис результату 1"
    },
    "CreateRouteComponent": {
        "title": "Давайте разом створимо маршрут для вивчення теми.",
        "content": "Щоб спробувати, будь ласка, перейдіть за посиланням нижче:",
        "register": "Бібліотека"
    },
    "Library": {
        "title": "Бібліотека",
        "bibliya": "Біблія",
        "cloud": "Хмара біблійного передання",
        "biblical": "Біблеїстика",
        "patristics": "Патристика",
        "philosophy": "Філософія і історія",
        "dictionaries": "Словники та енциклопедії",
        "literature": "Художня література",
        "theology": "Богослов`я"
    },
    "About": {
        "library": "Бібліотека",
        "aboutus": "Про нас",
        "howitworks": "Як це працює"
    },
    "AboutUs": {
        "title": "«Світ Біблії» – «World of the Bible»",
        "navigator": "Навігатор",
        "subtitle1": "Хто ми?",
        "par11": "Проєкт «Світ Біблії» реалізується Благодійним фондом «Медіаглагол»",
        "par12": "некомерційною організацією, що існує з 2014 року й успішно підтримує християнсько-просвітницьку діяльність на волонтерських засадах.",
        "par13": "Наш новий проєкт «Світ Біблії» - це масштабний онлайн ресурс, що надасть різним категоріям людей унікальну безплатну можливість для глибокого вивчення Біблії та християнської спадщини через інноваційну інтеграцію сучасних технологій та багатоформатних мультимовних та мультикультурних медіаресурсів.",
        "par14": "Ми плануємо використовувати штучний інтелект для виявлення унікальних гіпертекстуальних зв`язків між Біблією і текстами з художньої літератури, філософії, психології, історії та інших джерел зі статусом Public Domain, а також творами сучасних авторів, що погодилися на співпрацю з проєктом з метою показати, як різноманітні тексти, написані людьми, неодмінно тяжіють до єдиного центру біблійного одкровення.",
        "par15": "Наш проєкт об`єднає відео-, аудіо- та комунікаційні платформи, що допоможуть користувачам засвоювати біблійні наративи, а також запропонує унікальні маршрути для кожного користувача, створені через ШІ програму гіда.",
        "subtitle2": "Мета проєкту",
        "par21": "Наша мета - створення умов для вільного повернення членів постхристиянського суспільства до християнських духовних цінностей. У секулярному світі, де свобода вибору стала основою цивілізації, ми бачимо живу необхідність втілення біблійних істин, яка в минулому була основою моральних цінностей.",
        "par22": "Сумний досвід історії ХХ-початку ХХI столітть, з багатомільйонними жертвами терору та світових війн переконує: без вільного та глибокого повернення до християнських засад у суспільствах світу неодмінно виникає моральна дезорієнтація, яка призводить до деградації, розгулу війн, насилля та корупції. Тому своєю працею ми закликаємо до оновленого усвідомленого погляду на Біблію.",
        "subtitle3": "Чому ми?",
        "par31": "«Світ Біблії» — це інноваційний проєкт, який в унікальний спосіб поєднує сучасні технології та біблійні дослідження. Ми створюємо нові можливості для всіх, хто хоче глибше пізнати духовні істини через взаємодію з різноманітними медіаресурсами та комунікаційними платформами. Завдяки штучному інтелекту та персоналізованим маршрутам дослідження, кожен користувач може знайти свій унікальний духовний шлях в рамках нашого проєкту. Робота з ресурсом відбувається в привабливій формі мандрівки між різноманітними текстами, відео- та аудіо- джерелами та осередками спілкування за допомогою ШІ гіда, який враховує індивідуальні уподобання користувача.",
        "subtitle4": "Чому для спонсорів важливо інвестувати в нас?",
        "par41": "Інвестиції в «Світ Біблії» підтримують важливу культурно-освітницьку ініціативу, що змінює світ на краще через подолання розділень між різними християнськими спільнотами та різними культурними осередками, відображаючи глибокі зв`язки між світською та релігійною культурами.",
        "par42": "Спонсори отримують:",
        "receive1": "Видимість серед цільових груп проєкту (подяки всім спонсорам будуть на сайті без вказівки суми внеска).",
        "receive2": "Можливість участі у створенні контенту та організації культурно-просвітницьких заходів.",
        "receive3": "Співпрацю з дослідниками, письменниками та лідерами християнських груп для популяризації біблійних цінностей.",
        "par43": "Ваш внесок в наш проект допоможе оздоровити суспільство та зцілити токсичні патерни його існування через розповсюдження якісних християнських цінностей серед людей у сучасному світі. Інвестувати в нас - це можливість бути частиною глобальної ініціативи, яка прагне привести людей до глибшого усвідомлення та засвоєння духовних істин."
    },
    "HowItWorks": {
        "title": "Як це працює",
        "navigator": "Навігатор",
        "content":"Тут має бути сторінка Як це працює, на якій буде розповідь як користуватися сайтом. На мою думку сюди було б чудово теж додати слайди, на яких буде показано, що користувач може зробити на сайті. Ці слайди потрібно малювати саме під цей проєкт. Можливо, була б доречна якась відео-інструкція."
    },
    "HistoryComponent": {
        "history": "Тут буде історія переходів"
    },
    "Footer": {
      "email":"Пишіть нам: mediaglagol@gmail.com",
      "facebook": "Стежте за нами у Facebook",
      "telegram": "Підписуйтесь на наш Telegram-канал"
    },
    "CategoryComponent": {
        "all":"Всі",
        "bibl": "Біблія",
        "cloud": "Хмара біблійного передання",
        "bibl_studies":"Біблеїстика",
        "patrist":"Патристика",
        "phy_hist":"Філософія і Історія",
        "diction":"Словники та Енциклопедії",
        "theology":"Богослов'я"
    },
    "BibleUaPage": {
        "interpretation":"Тлумачення"
    }
}