'use client';

import { Link } from '@/i18n/routing';
import { useTranslations } from 'next-intl';
import { useState, useEffect, useRef } from 'react';
import { useNavigation } from '@/lib/navigation-context';
import { BOOKS_DATA } from '@/books-data_for-del';
import FontSizeControls from '@/components/FontSizeControls';

export default function AvgustinePage() {
	const t = useTranslations('BookContents');

	const { addBookToHistory } = useNavigation();
	const impRef = useRef<HTMLHeadingElement>(null);
	const currentBookLink = '/library/avgustine';

	const [isHighlighted, setIsHighlighted] = useState(false);
	const [bookContent, setBookContent] = useState<any>(null);

	useEffect(() => {
		if (!bookContent) {
			const foundBook = BOOKS_DATA.find((item) => item.link === currentBookLink);

			if (foundBook) {
				setBookContent(foundBook);
				addBookToHistory(foundBook.id);
			} else {
				setBookContent(null);
			}
		}

		const url = new URL(window.location.href);
		const hash = url.hash;
		const shouldScrollToSection = hash.includes('#imp') && hash.includes('scroll=true');

		if (shouldScrollToSection && impRef.current) {
			const mainElement = document.querySelector('main');

			if (mainElement) {
				mainElement.scrollTop = 0;
			}

			setIsHighlighted(true);

			setTimeout(() => {
				setIsHighlighted(false);
			}, 4000);

			setTimeout(() => {
				impRef.current?.scrollIntoView({
					behavior: 'smooth',
					block: 'start',
				});
			}, 1500);
		}
	}, [bookContent, addBookToHistory, currentBookLink]);

	if (!bookContent) {
		return <div>{t('loading')}</div>;
	}

	return (
		<div className="h-min-full flex">
			<div className="relative h-full w-full px-4 pt-2 block">
				<div className="absolute opacity-0">
					<FontSizeControls targetId="book-avgustine-font" />
				</div>
				<div id="book-avgustine-font" className="w-full">
					<h2 className="pt-0">«Сповідь» Блаженний Августин </h2>
					<section id="section1">
						<h3>Частина І</h3>
						<h3>Похвальна молитва</h3>
						<p>
							“Великий єси, Господи, і достойний безконечної хвали”; “велика
							могутність Твоя, і немає міри премудрості Твоїй” . І величати хоче Тебе
							лю дина, маленька частинка створіння Твого, лю дина, що носить із собою
							смертність свою, що носить із собою свідоцтво гріха свого і доказ, що
							Ти, Господи, “оііираєш ся гордим”2. Та одначе величати Тебе хоче лю дина
							— маленька частинка створіння Твого.
						</p>
						<p>
							Це ж Ти спонукаєш нас ш укати радощів у Твоїх похвалах, бо ж Ти створив
							нас для Себе, і серце наш е не супокійне, доки спочине в Тобі.
						</p>
						<p>
							Дай мені, Господи, знати й розум іти, чи найперш е треба волати до Тебе,
							чи величати Тебе, чи найперш е треба пізнати Тебе, чи волати до Тебе.
							Але хто ж волає до Тебе, не знаючи Тебе? Бо ж той, хто не знає Тебе, м
							ож е волати до когось інш ого, замість до Тебе. А м ож е, радш е волають
							до Тебе, щоб пізнати Тебе?
						</p>
						<p>
							“А ле ж як волатимуть до Того, у Кого не увірили?” І “як увірять, коли
							немає проповідника?”
						</p>
						<p>
							“І величатимуть Господа ті, що ш укають Його. Бо ті, щ о ш укають Його,
							знайдуть”4, а ті, що знайдуть, прославлятимуть Його.
						</p>
						<p>
							Нехай же я, Господи, шукаю Тебе, волаючи, і волаю до Тебе, вірую в Тебе!
							Бо Ти заповіданий нам. Волає до Тебе, Господи, віра моя, яку Ти дав
							мені, якою Ти надихнув мене через лю дяність Сина Твого, через
							посередництво проповідника Твого.
						</p>
						{/* ======================================================================== */}

						<p>
							“Великий єси, Господи, і достойний безконечної хвали”; “велика
							могутність Твоя, і немає міри премудрості Твоїй” . І величати хоче Тебе
							лю дина, маленька частинка створіння Твого, лю дина, що носить із собою
							смертність свою, що носить із собою свідоцтво гріха свого і доказ, що
							Ти, Господи, “оііираєш ся гордим”2. Та одначе величати Тебе хоче лю дина
							— маленька частинка створіння Твого.
						</p>
						<p>
							Це ж Ти спонукаєш нас ш укати радощів у Твоїх похвалах, бо ж Ти створив
							нас для Себе, і серце наш е не супокійне, доки спочине в Тобі.
						</p>
						<p>
							Дай мені, Господи, знати й розум іти, чи найперш е треба волати до Тебе,
							чи величати Тебе, чи найперш е треба пізнати Тебе, чи волати до Тебе.
							Але хто ж волає до Тебе, не знаючи Тебе? Бо ж той, хто не знає Тебе, м
							ож е волати до когось інш ого, замість до Тебе. А м ож е, радш е волають
							до Тебе, щоб пізнати Тебе?
						</p>
						<p>
							“А ле ж як волатимуть до Того, у Кого не увірили?” І “як увірять, коли
							немає проповідника?”
						</p>
						<p>
							“І величатимуть Господа ті, що ш укають Його. Бо ті, щ о ш укають Його,
							знайдуть”4, а ті, що знайдуть, прославлятимуть Його.
						</p>
						<p>
							Нехай же я, Господи, шукаю Тебе, волаючи, і волаю до Тебе, вірую в Тебе!
							Бо Ти заповіданий нам. Волає до Тебе, Господи, віра моя, яку Ти дав
							мені, якою Ти надихнув мене через лю дяність Сина Твого, через
							посередництво проповідника Твого.
						</p>
						<p>
							“Великий єси, Господи, і достойний безконечної хвали”; “велика
							могутність Твоя, і немає міри премудрості Твоїй” . І величати хоче Тебе
							лю дина, маленька частинка створіння Твого, лю дина, що носить із собою
							смертність свою, що носить із собою свідоцтво гріха свого і доказ, що
							Ти, Господи, “оііираєш ся гордим”2. Та одначе величати Тебе хоче лю дина
							— маленька частинка створіння Твого.
						</p>
						<p>
							Це ж Ти спонукаєш нас ш укати радощів у Твоїх похвалах, бо ж Ти створив
							нас для Себе, і серце наш е не супокійне, доки спочине в Тобі.
						</p>
						<p>
							Дай мені, Господи, знати й розум іти, чи найперш е треба волати до Тебе,
							чи величати Тебе, чи найперш е треба пізнати Тебе, чи волати до Тебе.
							Але хто ж волає до Тебе, не знаючи Тебе? Бо ж той, хто не знає Тебе, м
							ож е волати до когось інш ого, замість до Тебе. А м ож е, радш е волають
							до Тебе, щоб пізнати Тебе?
						</p>
						<p>
							“А ле ж як волатимуть до Того, у Кого не увірили?” І “як увірять, коли
							немає проповідника?”
						</p>
						<p>
							“І величатимуть Господа ті, що ш укають Його. Бо ті, щ о ш укають Його,
							знайдуть”4, а ті, що знайдуть, прославлятимуть Його.
						</p>
						<p>
							Нехай же я, Господи, шукаю Тебе, волаючи, і волаю до Тебе, вірую в Тебе!
							Бо Ти заповіданий нам. Волає до Тебе, Господи, віра моя, яку Ти дав
							мені, якою Ти надихнув мене через лю дяність Сина Твого, через
							посередництво проповідника Твого.
						</p>
						<p>
							“Великий єси, Господи, і достойний безконечної хвали”; “велика
							могутність Твоя, і немає міри премудрості Твоїй” . І величати хоче Тебе
							лю дина, маленька частинка створіння Твого, лю дина, що носить із собою
							смертність свою, що носить із собою свідоцтво гріха свого і доказ, що
							Ти, Господи, “оііираєш ся гордим”2. Та одначе величати Тебе хоче лю дина
							— маленька частинка створіння Твого.
						</p>
						<p>
							Це ж Ти спонукаєш нас ш укати радощів у Твоїх похвалах, бо ж Ти створив
							нас для Себе, і серце наш е не супокійне, доки спочине в Тобі.
						</p>
						<p>
							Дай мені, Господи, знати й розум іти, чи найперш е треба волати до Тебе,
							чи величати Тебе, чи найперш е треба пізнати Тебе, чи волати до Тебе.
							Але хто ж волає до Тебе, не знаючи Тебе? Бо ж той, хто не знає Тебе, м
							ож е волати до когось інш ого, замість до Тебе. А м ож е, радш е волають
							до Тебе, щоб пізнати Тебе?
						</p>
						<p>
							“А ле ж як волатимуть до Того, у Кого не увірили?” І “як увірять, коли
							немає проповідника?”
						</p>
						<p>
							“І величатимуть Господа ті, що ш укають Його. Бо ті, щ о ш укають Його,
							знайдуть”4, а ті, що знайдуть, прославлятимуть Його.
						</p>
						<p>
							Нехай же я, Господи, шукаю Тебе, волаючи, і волаю до Тебе, вірую в Тебе!
							Бо Ти заповіданий нам. Волає до Тебе, Господи, віра моя, яку Ти дав
							мені, якою Ти надихнув мене через лю дяність Сина Твого, через
							посередництво проповідника Твого.
						</p>
					</section>

					<section id="section2">
						<h3>Частина ІІ</h3>
						<h3 id="imp" ref={impRef}>
							Бог є в людині – людина в Бозі
						</h3>
						<div>
							<span className={isHighlighted ? 'text-primary' : ''}>
								Одначе як я волатиму до Бога мого, Бога й Господа мого?
							</span>{' '}
							Бо ж, волаючи до Нього, я мов би прохатиму, щоб Він увійшов у мене. І
							яке ж місце є в мені, в яке міг би увійти в мене Бог мій? Куди ж міг би
							увійти Бог у мене, Бог, що створив небо і землю? Чи ж можливо, Господи
							Боже мій, щоб я мав щось, що вмістило б Тебе? Чи обіймають Тебе «небо і
							земля», що Ти їх створив, і в лоні яких Ти створив і мене? Чи, може, з
							того, що існує, виходить, що все суще охоплює Тебе? Та якщо і я існую,
							то чому ж благаю Тебе, щоб Ти вступив в мене, у мене, що не існував би,
							коли б Тебе не було в мені?{' '}
							<span className="group relative">
								Бо нема мене ще в підземеллі, а Ти й там є, бо{' '}
								<span className="relative italic text-primary hover:primary-dark">
									«хоча б я зійшов і до Пекла, той там би знайшов Тебе».
									<div className="absolute bottom-full left-[25%] -translate-x-[25%] bg-yellow-300 text-gray-800 p-2 rounded-md text-sm opacity-0 transition-opacity duration-300 group-hover:opacity-100 whitespace-nowrap z-10">
										<Link
											href="/library/bible/psalmi/#psalom138&scroll=true"
											className="underline"
										>
											Книга Псалмів, псалом 138
										</Link>
									</div>
								</span>
							</span>
						</div>
						<div>
							«Отже, я не існував би, Боже мій, не існував би взагалі, якщо б Тебе не
							було б в мені.{' '}
							<span className="group relative">
								{' '}
								Або, скоріше, я б не існував, коли б не був у Тобі,{' '}
								<span className="relative italic text-primary hover:text-primary-dark">
									«з Якого, через Якого і в Якому – усе»?
									<div className="absolute bottom-full left-[25%] -translate-x-[25%] bg-yellow-300 text-gray-800 p-2 rounded-md text-sm opacity-0 transition-opacity duration-300 group-hover:opacity-100 whitespace-nowrap z-10">
										<Link
											href="/library/bible/romans#romans-11-32&scroll=true"
											className="underline"
										>
											Послання апостола Павла до римлян, розділ 11, вірші
											32-36
										</Link>
									</div>
								</span>
							</span>
						</div>
						<p>
							«Так, так, Господи, так воно є. Куди ж волаю до Тебе, коли я сам у Тобі?
							Або звідкіля ввійшов би Ти в мене? Бо куди ж я б мав відійти поза небо й
							землю, щоб звідтіля вступив у мене Бог мій, що сказав: «Це я виповнюю
							небо й землю».{' '}
						</p>
					</section>

					<section id="section3">
						<h3>Частина ІІІ</h3>
						<h3>Роздуми про природу Бога</h3>
						<p>
							Чи ж охоплюють Тебе небо й земля, оскільки Ти виповнюєш їх? А може, Ти
							їх виповнюєш, але ще лишається якась маленька частинка Твоєї істоти,
							тому що вони не охоплюють Тебе всього? А де ж Ти виливаєш те, що
							лишилося з Твоєї істоти після виповнення неба й землі? А може, Ти не
							потребуєш, щоби будь-що містило Тебе, Тебе, що охоплюєш усе, тому що те,
							що Ти виповнюєш, Ти виповнюєш, вміщаючи в собі? Бо не посудини, повні
							Тебе, надають Тобі стійкості; адже, хоча б вони й розбилися, Ти не
							виливаєшся. А коли Ти розливаєшся понад нами, то Ти не падаєш на землю,
							а нас підіймаєш угору; Ти не розсіваєшся, а нас громадиш. Але чи те все,
							що Ти виповнюєш, Ти виповнюєш цілою своєю істотою? Чи, може, тому, що ті
							всі речі не можуть охопити Тебе цілого, охоплюють тільки частинку Тебе,
							і ту саму частинку охоплюють одночасно всі? Чи, може, кожна річ охоплює
							якусь відповідну частинку, більші охоплюють більші, а менші охоплюють
							менші? Та чи ж є в Тобі якась частинка більша, а якась частинка менша?
							Чи, може, Ти всюди цілий, і ніяка річ не охоплює Тебе всього?
						</p>
					</section>

					<section id="section4">
						<h3>Частина IV</h3>
						<h3>Невимовна велич Бога</h3>
						<p>
							Чи ж охоплюють Тебе небо й земля, оскільки Ти виповнюєш їх? А може, Ти
							їх виповнюєш, але ще лишається якась маленька частинка Твоєї істоти,
							тому що вони не охоплюють Тебе всього? А де ж Ти виливаєш те, що
							лишилося з Твоєї істоти після виповнення неба й землі? А може, Ти не
							потребуєш, щоби будь-що містило Тебе, Тебе, що охоплюєш усе, тому що те,
							що Ти виповнюєш, Ти виповнюєш, вміщаючи в собі? Бо не посудини, повні
							Тебе, надають Тобі стійкості; адже, хоча б вони й розбилися, Ти не
							виливаєшся. А коли Ти розливаєшся понад нами, то Ти не падаєш на землю,
							а нас підіймаєш угору; Ти не розсіваєшся, а нас громадиш. Але чи те все,
							що Ти виповнюєш, Ти виповнюєш цілою своєю істотою? Чи, може, тому, що ті
							всі речі не можуть охопити Тебе цілого, охоплюють тільки частинку Тебе,
							і ту саму частинку охоплюють одночасно всі? Чи, може, кожна річ охоплює
							якусь відповідну частинку, більші охоплюють більші, а менші охоплюють
							менші? Та чи ж є в Тобі якась частинка більша, а якась частинка менша?
							Чи, може, Ти всюди цілий, і ніяка річ не охоплює Тебе всього?
						</p>
					</section>

					<section id="section3">
						<h3>Частина V</h3>
						<h3>Августин хоче очистити мешкання серця, щоб пожертвувати його Богові</h3>
						<p>
							Чи ж охоплюють Тебе небо й земля, оскільки Ти виповнюєш їх? А може, Ти
							їх виповнюєш, але ще лишається якась маленька частинка Твоєї істоти,
							тому що вони не охоплюють Тебе всього? А де ж Ти виливаєш те, що
							лишилося з Твоєї істоти після виповнення неба й землі? А може, Ти не
							потребуєш, щоби будь-що містило Тебе, Тебе, що охоплюєш усе, тому що те,
							що Ти виповнюєш, Ти виповнюєш, вміщаючи в собі? Бо не посудини, повні
							Тебе, надають Тобі стійкості; адже, хоча б вони й розбилися, Ти не
							виливаєшся. А коли Ти розливаєшся понад нами, то Ти не падаєш на землю,
							а нас підіймаєш угору; Ти не розсіваєшся, а нас громадиш. Але чи те все,
							що Ти виповнюєш, Ти виповнюєш цілою своєю істотою? Чи, може, тому, що ті
							всі речі не можуть охопити Тебе цілого, охоплюють тільки частинку Тебе,
							і ту саму частинку охоплюють одночасно всі? Чи, може, кожна річ охоплює
							якусь відповідну частинку, більші охоплюють більші, а менші охоплюють
							менші? Та чи ж є в Тобі якась частинка більша, а якась частинка менша?
							Чи, може, Ти всюди цілий, і ніяка річ не охоплює Тебе всього?
						</p>
					</section>
				</div>
			</div>
		</div>
	);
}
