"use client";
 
 import { useTranslations } from "next-intl";
 import { useState, useEffect, useRef } from "react";
 import { useNavigation } from "@/lib/navigation-context";
 import { BOOKS_DATA } from "@/books-data_for-del";
 
 export default function GospelOfJohnPage() {
    const t = useTranslations("BookContents");

    const { addBookToHistory } = useNavigation();
    const currentBookLink = "/library/bible/gospel-of-john"; 
    const gospelOfJohn1Ref = useRef<HTMLElement>(null);

    const [isHighlighted, setIsHighlighted] = useState(false);
    const [bookContent, setBookContent] = useState<any>(null);

useEffect(() => {
  if (!bookContent) { 
        const foundBook = BOOKS_DATA.find(item => item.link === currentBookLink);
  
        if (foundBook) {
          setBookContent(foundBook);
          addBookToHistory(foundBook.id);
        } else {
          setBookContent(null);
        }
      }
  const url = new URL(window.location.href);
  const hash = url.hash;
  const shouldScrollToSection = hash.includes('#gospel-of-john-1-1') && hash.includes('scroll=true');

  if (shouldScrollToSection) {
    setIsHighlighted(true); 
    // setTimeout(() => {
    //   setIsHighlighted(false);
    // }, 4000);

          if (gospelOfJohn1Ref.current) {
        gospelOfJohn1Ref.current.scrollIntoView({
          behavior: 'smooth', 
          block: 'start',   
        });
      }
  } else {
    setIsHighlighted(false);
  }
}, [bookContent, addBookToHistory, currentBookLink]); 

      if (!bookContent) {
        return <div>{t("loading")}</div>; }

     return (
        <div className="h-min-full flex">
          <div className="relative h-full w-full px-4 pt-2 block">
                        
  <div className="w-full">
  <h2 className="pt-0">Євангеліє від Івана (переклад І. Огієнка)</h2>
    <section id="gospel-of-john-1-1" ref={gospelOfJohn1Ref}
    className="mx-auto w-4/5 md:w-3/5 lg:w-1/2 px-2 border border-gray-300 rounded-md">
      <h2>Розділ 1</h2>
      <p className={isHighlighted ? 'text-primary ': ''}>1. Споконвіку було Слово, а Слово в Бога було, і Бог було Слово.</p>
      <p className={isHighlighted ? 'text-primary ': ''}>2. Воно в Бога було споконвіку.</p>
      <p className={isHighlighted ? 'text-primary ': ''}>3. Усе через Нього повстало, і ніщо, що повстало, не повстало без Нього.</p>
      <p className={isHighlighted ? 'text-primary ': ''}>4. У Ньому було життя, а життя було Світлом людей.</p>
      <p className={isHighlighted ? 'text-primary ': ''}>5. А Світло у темряві світить, і темрява Його не обійняла.</p>
      <p>6. Був чоловік, від Бога посланий, йому ймення Іван.</p>
      <p>7. Він прийшов на свідоцтво, щоб засвідчити про Світло, щоб усі вірили через нього.</p>
      <p>8. Він тим Світлом не був, але свідчити мав про Світло.</p>
      <p>9. Світло правдиве, що світить кожній людині, до світу приходило.</p>
      <p>10. Воно в світі було, і світ через Нього повстав, але світ Його не пізнав.</p>
      <p>11. До своїх Він прийшов, та свої Його не прийняли.</p>
      <p>12. А всім, що Його прийняли, їм владу дало дітьми Божими стати, тим, що вірять у Його Ймення,</p>
      <p>13. що не з крови, ані з пожадливости тіла, ані з пожадливости мужа, але від Бога народжені.</p>
      <p>14. І Слово сталося тілом, і перебувало між нами, повне благодаті та правди. І ми бачили славу Його, славу як Однородженого від Отця.</p>
      <p>15. Іван свідчив про Нього й кликнув, говорячи: Це Той, про Якого я казав: Той, Хто йде за мною, став передо мною, бо Він був перше, ніж я!</p>
      <p>16. А з Його повноти ми прийняли благодать замість благодаті.</p>
      <p>17. Закон бо через Мойсея був даний, а благодать та правда з&apos;явились через Ісуса Христа.</p>
      <p>18. Бога ніхто ніколи не бачив. Однороджений Син, що в лоні Отця, Той Сам об&apos;явив був.</p>
      <p>19. А оце свідоцтво Іванове, коли Юдеї послали були з Єрусалиму священиків та левитів, щоб спитали його: Хто ти такий?</p>
      <p>20. І він признався, і не зрікся, і признався: Я не Христос!</p>
      <p>21. І запитали його: То хто ж ти? Ілля ти? А він каже: Ні! Ти пророк? І відповів: Ні!</p>
      <p>22. І сказали йому: Хто ж ти такий? Щоб ми дали відповідь тим, хто нас послав. Що ти сам про себе кажеш?</p>
      <p>23. Він відказав: Я голос того, хто кличе в пустині: Рівняйте дорогу Господню, як Ісая пророк говорив.</p>
      <p>24. А посланці були з фарисеїв.</p>
      <p>25. І запитали його й сказали йому: Чого ж ти христиш, коли ти не Христос, ані Ілля, ані пророк?</p>
      <p>26. Іван їм відповів, говорячи: Я хрищу водою, а між вами стоїть Той, Кого ви не знаєте.</p>
      <p>27. Це Той, Хто йде за мною, Хто став передо мною, Якому розв&apos;язати ремінця взуття Його я не гідний!</p>
      <p>28. Це в Віфаварі сталося, по той бік Йордану, де христив Іван.</p>
      <p>29. Наступного дня Іван бачить Ісуса, що йде до нього, та й каже: Ось Агнець Божий, що бере гріх світу!</p>
      <p>30. Це Той, про Якого я казав: За мною йде Муж, що став передо мною, бо Він був перше, ніж я.</p>
      <p>31. І я не знав Його, та для того прийшов я, христивши водою, щоб Він Ізраїлеві об&apos;явився.</p>
      <p>32. Іван засвідчив, говорячи: Бачив я Духа, що сходив, як голуб із неба, і перебував Він на Ньому.</p>
      <p>33. І я не знав Його, але Той, Хто послав мене христити водою, сказав мені: Над Ким побачиш Духа, що сходить і перебуває на Ньому, Той є Той, Хто христить Духом Святим.</p>
      <p>34. І я бачив, і засвідчив, що Він — Син Божий!</p>
      <p>35. Другого дня знов стояв Іван із двома учнями своїми.</p>
      <p>36. І, поглянувши на Ісуса, що проходив, він сказав: Ось Агнець Божий!</p>
      <p>37. І почули два учні, як він говорив, та й пішли за Ісусом.</p>
      <p>38. А Ісус обернувся й побачив, що йдуть за Ним, та й каже до них: Чого ви шукаєте? А вони відказали Йому: Равві (що в перекладі означає: Учителю), де Ти живеш?</p>
      <p>39. Він говорить до них: Ідіть і побачите! І ті пішли й побачили, де Він живе, і в Нього той день пробули. Було ж коло години десятої.</p>
      <p>40. А одним із тих двох, що почули від Івана й пішли за Ним, був Андрій, брат Симона Петра.</p>
      <p>41. Він знайшов перше Симона, брата свого, та й каже йому: Ми знайшли Месію, що в перекладі означає: Христос!</p>
      <p>42. І привів він його до Ісуса. А Ісус поглянув на нього й сказав: Ти Симон, син Йонин; ти будеш зватися Кифа, що в перекладі означає: скеля.</p>
      <p>43. Наступного дня захотів Ісус піти в Галілею. І знайшов Він Пилипа та й каже йому: Іди за Мною!</p>
      <p>44. А Пилип був із Віфсаїди, з міста Андрієвого та Петрового.</p>
      <p>45. Пилип Нафанаїла знаходить та й каже йому: Ми знайшли Того, що про Нього писав був Мойсей у Законі й Пророки, Ісуса, сина Йосипового, із Назарету.</p>
      <p>46. І сказав йому Нафанаїл: Та хіба ж може бути з Назарету що добре? Пилип йому каже: Прийди та побач.</p>
      <p>47. Ісус, угледівши Нафанаїла, що до Нього йде, говорить про нього: Ото справді ізраїльтянин, що немає в нім підступу!</p>
      <p>48. Говорить Йому Нафанаїл: Звідки знаєш мене? Ісус відповів і до нього сказав: Я бачив тебе ще давніш, ніж Пилип тебе кликав, як під фіґовим деревом був ти.</p>
      <p>49. Відповів Йому Нафанаїл: Учителю, Ти Син Божий, Ти Цар Ізраїлів!</p>
      <p>50. Ісус відповів і до нього сказав: Через те віриш ти, що сказав Я тобі, що під фіґовим деревом бачив тебе? Більш від цього побачиш!</p>
      <p>51. І Він каже йому: Поправді, поправді кажу вам: Відтепер ви побачите небо відкрите та Анголів Божих, що на Людського Сина підіймаються та спускаються.</p>
    </section>

  </div>
</div>
         </div>  
         );
         }