"use client";

export default function InterpretationPage2() {
    return (
        <div
            className="interpretation-text mt-6 py-8 px-4 lg:pb-48 w-full lg:w-1/2 absolute lg:relative left-0 inset-40vh lg:inset-0 h-40vh lg:h-auto max-h-40vh lg:max-h-screen overflow-y-auto">
            <h3>Библия. Перевод Нового Мира (ПНМ)</h3>

            <div>
             <p>1.В начале Бог сотворил небеса и землю.</p>
            <p> 2.Земля была бесформенна и пуста, и на поверхности водной пучины была тьма, и действующая сила
                        Бога носилась над поверхностью вод.</p>
            <p> 3.И сказал Бог: «Пусть будет свет». И появился свет.</p>
            <p> 4.Бог увидел, что свет хорош, и отделил Бог свет от тьмы.</p>
            <p> 5.Бог назвал свет Днём, а тьму — Ночью. И был вечер, и было утро — день первый.</p>
            <p> 6.И сказал Бог: «Пусть будет пространство между водами и пусть будут отделены
                                        воды
                                        от
                                        вод».</p>
            <p>7.Тогда Бог создал пространство и отделил воды под пространством от вод над
                                        пространством. И
                                        стало так.</p>
                <p>8.Бог назвал пространство Небом. И был вечер, и было утро — день второй.</p>
                    <p>9.И сказал Бог: «Пусть воды под небесами соберутся в одно место и пусть появится
                        суша».
                        И
                        стало
                        так.</p>
                <p>10.Бог назвал сушу Землёй, а собранные воды назвал Морями. И увидел Бог, что это
                    хорошо.</p>
                    <p>11.Затем Бог сказал: «Пусть земля произведёт траву, растения, дающие семена,
                        плодовые
                        деревья,
                        приносящие по своему роду плоды с семенами,— пусть так будет на земле». И стало
                        так.</p>
                <p>12.Земля произвела траву, растения, дающие семена по их роду, и деревья,
                    приносящие
                    плоды с
                    семенами по их роду. И увидел Бог, что это хорошо.</p>
                    <p>13.И был вечер, и было утро — день третий.</p>
                        <p>14.И сказал Бог: «Пусть в небесном пространстве появятся светила, чтобы отделять
                            день от
                            ночи, и
                            пусть они служат знаками и указывают времена года, дни и годы.</p>
                <p>15.И пусть они служат светилами в небесном пространстве, чтобы светить на
                    землю». И
                    стало
                    так.</p>
                    <p>16.Бог создал два великих светила: большое светило, чтобы господствовало над
                        днём, и
                        малое
                        светило, чтобы господствовало над ночью, и звёзды.</p>
                        <p>17.Бог поместил их в небесном пространстве, чтобы они светили на землю,
                            18.господствовали днём и ночью и отделяли свет от тьмы. И увидел Бог, что это
                            хорошо.</p>
                <p>19.И был вечер, и было утро — день четвёртый.</p>
                    <p>20.И сказал Бог: «Пусть воды закишат множеством живых душ и пусть над землёй по
                        небесному
                        пространству полетят летающие создания».</p>
                <p>21.И Бог сотворил огромных морских чудовищ и всякую двигающуюся живую душу,
                    которыми
                    кишат
                    воды,
                    по их родам, и всякое крылатое летающее создание по его роду. И увидел Бог, что
                    это
                    хорошо.</p>
                    <p>22.Тогда Бог благословил их, сказав: «Плодитесь и размножайтесь и наполняйте
                        воды
                        морей
                        и
                        пусть
                        на земле будет много летающих созданий».</p>
                <p> 23.И был вечер, и было утро — день пятый.</p>
                    <p>24.И сказал Бог: «Пусть земля произведёт живых душ по их родам: домашнее
                        животное,
                        всякое
                        двигающееся животное и земного зверя по его роду». И стало так.</p>
                <p>25.Бог создал земного зверя по его роду, домашнее животное по его роду и всякое
                    земное
                    двигающееся животное по его роду. И увидел Бог, что это хорошо.</p>
                    <p>26.И сказал Бог: «Создадим человека по нашему образу, по нашему подобию, и пусть
                        он
                        господствует
                        над морскими рыбами, над созданиями, летающими в небесах, над домашними
                        животными,
                        над
                        всей
                        землёй и над всяким двигающимся животным, которое передвигается по земле».</p>
                <p>27.И Бог сотворил человека по своему образу, сотворил его по образу Бога. Он
                    сотворил их
                    мужчиной и женщиной.</p>
                    <p>28.Затем Бог благословил их и сказал им: «Плодитесь и размножайтесь, наполняйте
                        землю,
                        возделывайте её и господствуйте над морскими рыбами, над созданиями, летающими в
                        небесах, и
                        над
                        всяким живым существом, которое передвигается по земле».</p>
                <p>29.И сказал Бог: «Я дал вам все растения на поверхности всей земли, дающие
                    семена, и
                    все
                    деревья, приносящие плоды с семенами. Пусть это будет вам пищей.</p>
                    <p>30.И всякому земному зверю, всякому созданию, летающему в небесах, и всем душам,
                        которые
                        передвигаются по земле и в которых есть жизнь, я дал в пищу все зелёные
                        растения». И
                        стало
                        так.</p>
                        <p> 31.Тогда Бог посмотрел на всё, что он создал, и увидел, что всё это очень
                            хорошо. И
                            был
                            вечер, и
                            было утро — день шестой.
                        </p>
            </div>
            </div>
);
}
