"use client";
export default function InterpretationPage() {


    return (
        <div
            className="interpretation-text mt-6 py-8 px-4 lg:pb-48 w-full lg:w-1/2 absolute lg:relative left-0 inset-40vh lg:inset-0 h-40vh lg:h-auto max-h-40vh lg:max-h-screen overflow-y-auto">
            <h3>Толковая Библия А. Лопухина</h3>

            <div>
                <p>1. В начале… Как у святых Отцов, так и во всей последующей истолковательной литературе существуют два
                    главных типических толкования данного слова.<br></br> По господствующему мнению одних - это простое
                    хронологическое указание «на начало творения видимых вещей» (Ефрем Сирин), т. е. всего того, история
                    постепенного образования чего излагается непосредственно далее. <br></br>По аллегорическому же толкованию
                    других (Феоф. Ант., Ориген, Амвросий, Августин и пр.), слово «в начале» имеет здесь индивидуальный
                    смысл, заключая в себе прикровенное указание на предвечное рождение от Отца второй Ипостаси Святой
                    Троицы - Сына Божия, в Котором и через Которого было совершено все творение (Ин 1:3); (Кол 1:16).
                    <br></br>Относящиеся сюда библейские параллели дают право объединять оба этих толкования, т. е. как находить
                    здесь указание на мысль о совечном Отцу рождении Сына или Логоса и об идеальном создании в Нем мира
                    ( (Ин 1:1-3,10); (Ин 8:25); (Пс 83:3); (1Пет 1:20); (Кол 1:16); (Откр 3:14), так и еще с большим
                    правом видеть здесь прямое указание на внешнее осуществление предвечных планов божественного
                    Мироздания в начале времени или, точнее, вместе с самым этим временем (Пс 101:26); (Евр 1:10); (Пс
                    83:12-13); (Пс 135:5-6); (Пс 145:6); Притч 8.22-23; (Ис 64:4); (Ис 41:4); (Сир 18:1); и пр.).
                    <br></br>«Сотворили» - здесь употреблено слово бара, которое по общему верованию как Иудеев, так и христиан,
                    равно как и по всему последующему библейскому употреблению, преимущественно служит выражением идеи
                    божественного делания (Быт 1:1); (Быт 2:3-4); (Ис 40:28); (Ис 43:1); (Пс 148:5); (Исх 34:10); (Чис
                    16:30); (Иер 31:22); (Мал 2:10) и др.), имеет значение творческой деятельности или создания из
                    ничего (Чис 16:30); (Ис 45:7); (Пс 101:26); (Евр 3:4); (Евр 11:3); (2Мак 7:28) и др.). <br></br>Этим
                    самым,
                    следовательно, опровергаются все материалистические гипотезы о мире как самобытной сущности, и
                    пантеистические - о нем как об эманации или истечении божества и устанавливается взгляд на него как
                    на дело рук Творца, воззвавшего весь мир из небытия к бытию волей и силой Своего божественного
                    всемогущества. «небо и землю…» Небо и земля, как два конкретных противоположных полюса всего
                    Мирового глобуса, обычно служат в Библии обозначением «всей вселенной» (Пс 101:26); (Ис 65:17); (Иер
                    33:24); (Зах 5:9). <br></br>Кроме того, многие находят здесь раздельное указание на сотворение мира видимого
                    и невидимого, или Ангелов (Феоф. Ант., Василий Великий, Феодорит, Ориген, Иоанн Дамаскин, и др.).
                    Основанием последнего толкования служит, во-первых, библейское употребление слова «небо» в качестве
                    синонима небожителей, т. е. ангелов (3Цар 22:19); (Мф 18:10) и др.), а во-вторых, и контекст данного
                    повествования, в котором последующее хаотическое неустройство приписывается лишь одной земле, т. е.
                    видимому миру (2 стих), чем «небо» отделяется от «земли» и даже как бы противополагается ей в
                    качестве благоустроенного, невидимого горного мира. <br></br>Подтверждение этому можно находить как в Ветхом
                    (Иов 38:4-7), так и в особенности Новом Завете (Кол 1:16).</p>
                    <p>
                        2. Понятие «земли» на языке Библии часто обнимает собой весь земной шар, со включением сюда и видимого неба как его наружной атмосферической оболочки (Быт 14:19-22); (Пс 32:6). <br></br>В
                        этом именно смысле оно употреблено и здесь, как это очевидно из контекста, по свидетельству которого хаотическая масса этой «земли» впоследствии выделила из себя твердь и воду (Быт 1:7). <br></br>Слова
                        «безвидна и пуста», которыми характеризуется первобытная масса, заключают в себе мысль о «тьме, беспорядке и разрушении» (Ис 40:17); (Ис 45:18); (Иер 4:23-26), т. е. дают идею о состоянии полного хаоса, в котором элементы будущего света, воздуха, земли, воды и также все зародыши растительной и животной жизни не поддавались еще никакому различению и были как бы перемешаны между собой. <br></br>Лучшей
                        параллелью к этим словам служит место из книги Премудростей Соломона, в котором говорится, что Бог сотворил мир из «необразного вещества» (Прем 11:18) и (2Пет 3:5) «и тьма над бездною…» Эта тьма была естественным следствием отсутствия света, который еще не существовал в качестве отдельной самостоятельной стихии, будучи выделен из первобытного хаоса лишь впоследствии, в первый день недели творческой деятельности. <br></br>«Над
                        бездною» и «над водою». <br></br>В тексте подлинника стоят здесь два родственных по смыслу еврейского слова (tehom и maim), означающих массу воды, образующую целую «бездну»; этим самым делается указание на расплавленное жидкообразное состояние первозданного, хаотического вещества. <br></br>«и
                        Дух Божий носился…» В объяснении этих слов толковники довольно сильно расходятся между собою: одни видят здесь простое указание на обыкновенный ветер, ниспосланный Богом для осушения земли (Тертуллиан, Ефрем Сирин, Феодорит, Абен-Езра, Розенмюллер), другие - на Ангела, или особую умную силу, назначенную для той же цели (Златоуст, Кайзетан и др.), третьи, наконец, - на Ипостасного Духа Божия (Василий Великий, Афанасий, Иероним и большинство прочих экзегетов). <br></br>Последнее
                        толкование предпочтительнее прочих: оно указывает на участие в деле творения и третьего лица Святой Троицы, Духа Божия, являющего Собой ту зиждительно-промыслительную силу, которая, по обще-библейскому воззрению, обусловливает происхождение и существование всего мира, не исключая и человека (Быт 2:7); (Пс 32:6); (Иов 27:3); (Ис 34:16); (Деян 17:29) и др.). <br></br>Самое
                        действие Святого Духа на хаос уподобляется здесь действию птицы, сидящей в гнезде на яйцах и согревающей их своей теплотой для пробуждения в них жизни (Втор 32:11). Этим самым, с одной стороны, позволяется усматривать в хаосе и некоторое действие естественных сил, аналогичное процессу постепенного образования в яйце зародыша, с другой, - как эти самые силы так и результаты их поставляются в прямую зависимость от Бога.
                    </p>
                </div>
            </div>
            );
            }
