"use client";
 
 import { Link } from "@/i18n/routing";
 import { useTranslations } from "next-intl";
 import { useState, useEffect } from "react";
 import { ChevronDown, ChevronUp, CircleX } from "lucide-react";
 import { ChevronFirst, ChevronLast } from "lucide-react";
 import { About } from "@/components/about";
 import History from "@/components/history";
 import FontSizeControls from "@/components/FontSizeControls";
 
 export default function DankovaPage() {
    const t = useTranslations("BookContents");

     const [showPage, setShowPage] = useState(false);
     const [showContent, setShowContent] = useState(false);
     const [expanded, setExpanded] = useState(true);
     const [expanded1, setExpanded1] = useState(true);
     const [storedBook, setStoredBook] = useState<string[]>([])
     const [newId, setNewId] = useState('')
 
       if (newId) {
         const findBookById = storedBook.find(item => item === newId)  
 
         if (findBookById === undefined) {
             sessionStorage.setItem('bookname', JSON.stringify([...storedBook, newId]))
           } 
       }
 
       useEffect(() => {
         const savedBooks = sessionStorage.getItem('bookname')
         if (savedBooks) {
           setStoredBook(JSON.parse(savedBooks))
         }
       }, [])
 
       const togglePage = () => {
         setShowPage(!showPage)
     }; 
     
  
     return (
        <div className="h-min-full flex">
             <div className="relative">
                         <button onClick={() => setExpanded(curr => !curr)}
                                 className={`absolute top-4 z-20 ${expanded ? "left-60 dark:bg-secondary" : "left-8 dark:bg-background"} hidden md:block p-1.5 rounded-lg bg-gray-50 hover:bg-gray-100 dark:color-white`}>
                             {expanded ? <ChevronFirst/> : <ChevronLast/>}
                         </button>
                     </div>
         
                     <div
                         className={`hidden h-screen w-72 min-w-72 overflow-y-auto bg-secondary pb-12 shadow-lg ${
                             expanded ? "md:block" : "initial"
                         }`}>
                             <div>
                             <About/>
                                 
                                 <div className="bg-secondary px-6 pt-1 pb-8">
                                     <div className="py-2 flex justify-between font-medium">
                                         <button className={`w-1/2 ${showContent ? "" : "border-b-2 border-blue-500 text-blue-500"}`}  
                                             onClick={() => {setShowContent(false)}}>
                                                 {t('navigator')}
                                         </button>
                                         <button className={`w-1/2 ${showContent ? "border-b-2 border-blue-500 text-blue-500" : ""}`} 
                                             onClick={() => {setShowContent(true)}}>
                                                 {t('content')}
                                         </button>
                                     </div>
             
                                 {showContent ? 

<ul className="list-none bg-secondary pl-0">
<li>
    <Link href='/library/dankova/#section1' 
        className="block py-2 rounded-lg hover:bg-blue-200 dark:hover:text-stone-800 transition-colors duration-200">
        Частина 1
    </Link>
</li>
<li>
    <Link href='/library/dankova/#section2' 
        className="block py-2 rounded-lg hover:bg-blue-200 dark:hover:text-stone-800 transition-colors duration-200">
            Частина 2
    </Link>
</li>  
<li>
    <Link href='/library/dankova/#section3' 
        className="block py-2 rounded-lg hover:bg-blue-200 dark:hover:text-stone-800 transition-colors duration-200">
        Частина 3
    </Link>
</li>
<li>
    <Link href='/library/dankova/#section4' 
        className="block py-2 rounded-lg hover:bg-blue-200 dark:hover:text-stone-800 transition-colors duration-200">
            Частина 4
    </Link>
</li>
<li>
    <Link href='/library/dankova/#section5' 
        className="block py-2 rounded-lg hover:bg-blue-200 dark:hover:text-stone-800 transition-colors duration-200">
        Частина 5
    </Link>
</li>
<li>
    <Link href='/library/dankova/#section6' 
        className="block py-2 rounded-lg hover:bg-blue-200 dark:hover:text-stone-800 transition-colors duration-200">
            Частина 6
    </Link>
</li>  
<li>
    <Link href='/library/dankova/#section7' 
        className="block py-2 rounded-lg hover:bg-blue-200 dark:hover:text-stone-800 transition-colors duration-200">
        Частина 7
    </Link>
</li>
<li>
    <Link href='/library/dankova/#section8' 
        className="block py-2 rounded-lg hover:bg-blue-200 dark:hover:text-stone-800 transition-colors duration-200">
            Частина 8
    </Link>
</li>
<li>
    <Link href='/library/dankova/#section9' 
        className="block py-2 rounded-lg hover:bg-blue-200 dark:hover:text-stone-800 transition-colors duration-200">
        Частина 9
    </Link>
</li>
<li>
    <Link href='/library/dankova/#section10' 
        className="block py-2 rounded-lg hover:bg-blue-200 dark:hover:text-stone-800 transition-colors duration-200">
            Частина 10
    </Link>
</li>  
<li>
    <Link href='/library/dankova/#section11' 
        className="block py-2 rounded-lg hover:bg-blue-200 dark:hover:text-stone-800 transition-colors duration-200">
        Частина 11
    </Link>
</li>
<li>
    <Link href='/library/dankova/#section12' 
        className="block py-2 rounded-lg hover:bg-blue-200 dark:hover:text-stone-800 transition-colors duration-200">
            Частина 12
    </Link>
</li>
</ul>  :
                                 <History />}    
                                 </div>
                             </div>   
                     </div> 
         
         
                     <div className={`relative h-full w-full px-4 pt-2  ${showPage ? "md:flex md:h-screen block" : "block"} `}>
       
       <div className={`  ${showPage ? "px-3 mb-3 md:mb-0 border-2 border-blue-200 rounded-lg md:border-none md:w-1/2 md:h-screen h-40vh w-full overflow-y-scroll" : "w-full"} `}>
<FontSizeControls targetId="book-content" />
 <h2 className="pt-0">«Сім ночей перед Різдвом» Н.Данькова</h2>
 <h3>Видавництво &rdquo;Книги ХХІ&rdquo;/&rdquo;Чорні вівці&rdquo; (З дозволу директора Василя Дроняка)</h3>
 
 <section id="section3">
  <p>
    <span className="page-number text-gray-500 text-sm italic mr-2">Ст 66-68</span>
<p>
Сірий будинок, вузенький на три вікна, непримітно никнув за рогом людної вулиці. Перше Ян проходив повз нього
    тисячі разів і жодного разу не зважив на те, що ці ковані двері відчиняються в повечірній час для тих, хто
    має жовтий конверт із коштовною печаткою. Вони розійшлись і перед ним, повільно й зі скрипом. Він ступив у
    тісний коридор, а далі — у розлогу галерею.
</p>
  </p>
  <p>
    Це важко пояснити, але із середини дім був велетенський, Ян ніяк не міг утямити, як ці зали, арки, сади,
    переходи, східці та сотні кімнат уміщаються в будинку на три вікна. Тисячоокий сірий дім. У галереї двоє
    лакеїв узяли його верхній одяг, светр і навіть взуття. В оселі Неронаходять босоніж.
  </p>
  <p>
    Замість килимів і паркету на долівку сипали пісок. Червоний і липкий. Кажуть, це корисно для ніг,
    особливо для пласкої стопи. На ту ваду страждав імператор. А ще на пурпурному піску нічого не видно.
  </p>
  <p>
    Ян минув із десяток кімнат перш ніж потрапив до мармурової зали. Піщинки западали між пальці й відскакували вбік
    — він ішов нетерпляче.
  </p>
  <p>
    Небагато було тих, хто бачив обличчя імператора. При люді він з’являвся зрідка, повсякчас здалеку, оточений щільним
    колом вірних сподвижників. І завжди його лице тінив каптур чи капелюх.
  </p>
  <p>
    Прислужник вказав йому на вхід до зали й пішов. Але Ян дивився в бік: його вабили вузенькі, гвинтові сходи. Звідти
    він чув живий спів і пішов за ним. Униз. Туди, звідки кликало. Усе, що дише — співає на струнах і органі.
  </p>
  <p>
    Босі ноги ковзали східцями, очі вглядались у морок, звикали. Двері. Зачинені не щільно. Кімната нижча від
    землі, у ній — десятеро.
  </p>
  <p>
    Вони сиділи вздовж стіни, зв’язані мотузками та темрявою. Їхні обличчя, одяг і тіло — вимащені глиною. Їхні дзбани
    розламані навпіл. Червоний пісок сочився із них. Глиняна кров, безсоння із глини, і божевілля гле-вке,
    глиняне. А ще (то найдужче втяло Яна) в одному з них він упізнав очі Авеля. Такі дивні, майже прозорі
    очі він бачив у чабанів, коли бував у горах. Вони гляділи овець там, де світ забував про них. Ян зронив погляд
    і піднявся нагору.
  </p>
  <p>
    Мармурова зала не мала кутів і стелі. Кругла, із зоряним зводом, як колізей. Замість дверей два дерева росли при вході.
    А замість вікон тисяча щілин. Коли занадто ясно знадвору світило сонце, то слуги опускали серпанок
    із гардин. Не вільно сонцю ворушити спокій у будинку на три вікна!
  </p>
  <p>
    Зорі замість стелі мерехтіли й тішили зір імператора, який любив усе красиве. Півколом у мармуровій залі
    стояло 75 стільців, а поодаль від них — кам’яне крісло.
  </p>
  <p>
    — Цей камінь бачив потоп. Він встояв, коли вода ковтнула найвищі гори. У ньому моя міць і сила.
  </p>
  <p>
    Ян обернувся — імператор увійшов нечутно. Нероніз вигляду скидався на юнака, хоч був значно старшим.
    Вродливий, стрункий, із темним волоссям і загостреними вилицями, вдітий у сірий оксамитовий костюм
    із високим комірцем. Він стежив за гостем невідступно і, здавалося, ладен вловити щонайменший порух думки. Але
    його красиві сірі очі були нерухомі. Наче вилиті з венеціанського скла.
  </p>
  <blockquote>
    <p>— З очей видко серце. Моє не б’ється, — Нерондоклав долоню до грудей. Тихо. Твердо.</p>
  </blockquote>
  <p>
    Імператор мав невиліковну уразу — кам’яне серце. Набув її в мандрівці до Острова химер. Троє мисливців впали від
    його руки, лиш наостанок вистрелили в груди. Він мав би стати скелею, та встояв, об його серце розламалися
    три стріли. Відтоді радість зайва, біль далекий, сум незнаний, страх глухий. Не така вже це й біда. Але ураза
    ширилася, розповзалася на все тіло. Бувало, за ніч скам’яніє нога, рука чи шия. Те, звісно, скоро відходило,
    за годину чи дві тіло тепліло, вертався в нього трем і кров. Але неміч не відпускала. І тамувала її тільки
    врода.
  </p>
  <blockquote>
    <p>— Я люблю все красиве, — імператор сів у крісло. Його він уподобав, щоби щодень звикати до каменя і не боятися
    його.</p>
  </blockquote>
  <p>
    Неронпрагнув наповнити порожнину у грудях жаданою красою. Лише вона давала змогу відчувати. Він брав собі
    все, що впадало в око: квітку, прикрасу, жінку, музику чи усмішку. Він випивав усе ненатло, ковтав, спустошував,
    ламав. І жив. Бо й камінь уміє жити незгірше за людину із крові та плоті.
  </p>
</section>

<section id="section4">
  <p>
    <span className="page-number text-gray-500 text-sm italic mr-2">Ст 79</span>
  </p>
  <p>
  Зранку, лишень розвиднілось, Ян без вудки й волока пішов на берег ловити рибу, яка все життя тікала з його рук.
    Скинув сорочку, закачав холоші й увійшов у воду. За часинку море збурилося, біла риба вискочила із хвиль і схопила
    його ногу, а Ян учепився до її голови і тримав щосили голіруч, доки не витяг на берег.
  </p>
  <p>
    Риба співала, він слухав і виводив її пісню поряд на піску. Потому скупав братову сорочку в солоній воді, взяв
    улов і приніс матері, щоби приготувала смачних наїдків — тих, що любив батько.
  </p>
  <p>
    Йован лежав у широкому човні, що слугував йому замість ліжка. Він, іще як бачив, витесав його з дуба й осмолив
    зсередини та зовні. Відтоді стелив собі постіль у ньому й чув знайомий шепіт моря. Щодень він ближчав.
  </p>
  <p>
    — Наш син приїхав, — тихо сказала Авреля і розсунула завіски на вікнах.
  </p>
  <p>
    — Іво! — він скільки міг піднявся на тремтячі лікті.
  </p>
  <p>
    — Так, батьку, — Ян увійшов і назвався братом. Він вдів його сорочку, він вкрав у моря сіль.
  </p>
  <p>
    Батьконе впізнав його і зрадів. Він їв печену рибу й зір вертався до його вицвілих зіниць.
  </p>
  <p>
    Він бачив так далеко, що навіть очі орла не сягають тих країв, він чув слова, що їх не відають уста, він
    ішов дорогою, яка минає світ.
  </p>
  <blockquote>
    <p>— Хлопчику, мій Іво, ти вмієш ловити рибу. Коли б і брат твій умів… — Йован поглянув на нього так журно, ніби все
    бачив і все зрозумів.</p>
  </blockquote>
  <p>
    Ян поцілував його, він пахнув морем. І батько благословив його замість Іво, і віддав йому своє благословення, і
    вклав його до Янового серця. Росою із Неба, вітром із моря, ситістю із землі.
  </p>
  <p>
    — Батьку, я дуже люблю тебе.
  </p>
  <blockquote>
    <p>— Іво, мій добрий щирий хлопчик. Турбуйся про брата, бо він непевний, у його серці мало віри. Віри та Різдва.</p>
  </blockquote>
  <p>
    Ян опустився перед ним на коліна й не відпускав його руки. Авреля лягла в човен, поряд із чоловіком, схилилася
    до його плеча й заснула.
  </p>
  <p>
    Янові батьки пішли від нього в один день. Пішли, як і жили — міцно тримаючись за руки.
  </p>
</section>

<section id="section5">
  <p>
    <span className="page-number text-gray-500 text-sm italic mr-2">Ст 82</span>
  </p>
  <p>
  Третій чабан глядів на хлопця схитра й ніби випробовував його. Він знав, що той приходив у гори, щоби напитись
  їхньої свободи, діткнутися простору, який спиняє час.
  </p>
  <blockquote>
    <p>— Щоби бути вільним тре уміть віддати.</p>
  </blockquote>
  <p>— Що?</p>
  <blockquote>
    <p>— Усе.</p>
  </blockquote>
  <blockquote>
    <p>А ти в нас, Яне, юнак хитрий і багатий, — він підморгнув до нього і вклав лютий тютюн у люльку. А перший
    чабан дістав йому вогню.</p>
  </blockquote>
  <p>— Чи такий уже й багатий? У моїй кишені дріб’язку не більше ніж у вас. Та й за ним я не шкодую, як згублю. До того
  я байдужий, а як чогось не стане, візьмусь до скрипки, заграю і матиму. А коли ні, то втішуся і так.</p>
  <blockquote>
    <p>— Хіба те дрібка? Який же ж ти жебрак, коли так управно ворушиш струни, що навіть місяць у потемках схиляється
    до нашої гори?</p>
  </blockquote>
  <p>— Чи хто закопує в землю те, що має? Коли натрапив на один талан, примножуй їх до десяти, і навіть ста!</p>
  <p>Білясті очі Авеля кололи його наскрізь.</p>
  <blockquote>
    <p>— А чи віддаси всі ці сто чи десять Тому, Хто перше дав один? Чи дійсно спраглий ти, щоби йти по воду крізь ущелину,
    завширшки з вушко голки? Із нею можна все, ти іншого не схочеш, але вода та дуже дорога. Мій хитрий
    хлопче, твоє око горде, бо з десяти таланів — дев’ять маєш за свої, бо «твій Пан жорстокий жне, що не посіяв, і збирає
    те, що не розсипав».</p>
  </blockquote>
  <p>На світанку третій чабан ходив садити зерна. І Ян бачив, як за його словом порушилася гора. Хлопець знав, що коли чабан їй
  скаже: «Кинься в море», — вона без роздумів пірне.</p>
  <blockquote>
    <p>Лише за одним словом, дрібним, гірчичним, бо воно живе.</p>
  </blockquote>
</section>

<section id="section6">
  <p>
    <span className="page-number text-gray-500 text-sm italic mr-2">Ст 97</span>
  </p>
  <p>
  Голос, який не тоне й не горить.
  </p>
  <blockquote>
    <p>«Відірваний од берега, од материка… Холодні крижини все дужче й дужче сковують берег… Тільки з лету й
    на човні, які не бояться крижаної “шуги”, до нас можна буде дістатись», — вів голос. Може, і він колись
    тримав у руках такого лева.</p>
  </blockquote>
  <p>Єва знову засвітила в коридорі торшер, і зеленаве світло димно сочилось у щілину дверей. Злата мружилася сильніше
  і слухала:</p>
  <blockquote>
    <p>«Нещодавно якось прокинувся пізно вночі. Довкола сплять… темний душний барак із ліхтарем, що мерехтить
    попід стелею. Тіла скупчились. Багато, багато людей. Звична, добре знайома картина, звичне відчуття багатьох
    ночей цих двох років… І на серці страшна самотність, неміч дитяча й невимовна…».</p>
  </blockquote>
  <p>Слухати голос було важко — дужа напруга проймала все тіло від щонайменшого дотику до цього, привезеного невідь-звідки,
  експонату:</p>
  <blockquote>
    <p>«Життя минає однобарвно… У дощових сірих сутінках губиться початок і кінець дня, а середина тоне в одноманітній
    праці, коли довгі години стоїш у величезному бараку зі своїм ножем і калаталом перед кошиками… Душа якось
    завмирає, грубіє від цієї постійної брутальності довкіл: дикості, шаленства, лайки й осуду».</p>
  </blockquote>
  <p>Голос любив дивитись у небо, любив бродити біля моря та озер, любив птахів і навіть хмари, які впали на його чоло:</p>
  <blockquote>
    <p>«Роки минають у пам’яті… Одні — як хмари, осяяні промінням. Другі — як сині, синіхмари… Треті — як хмари
    буремні, темні, свинцеві, страшні… Ось я один у лікарні, у в’язниці…».</p>
  </blockquote>
  <p>о. А. Ж.— голос мав свої ініціали, і своє життя мав теж:</p>
  <blockquote>
    <p>«…тут я самотній зовсім. Тут зовсім не має близьких… І тут так близько, вічно близько Він…».</p>
  </blockquote>
</section>

<section id="section7">
  <p>
    <span className="page-number text-gray-500 text-sm italic mr-2">Ст 101</span>
  </p>
  <p>
  Дівча зраділо, розплюскало джерельце, встромило руки до самого дна — в її долоньки стрибнули три
  маленькі жабки. Сизі, як вода.
  </p>
  <p>— Дивися, Злато! — Геля розказала їй, як колись вона втекла від няні й заснула коло джерельця при вербі. Але
  заснула якось дивно, бо бачила трьох жабок: перша сіла їй на голову й узяла всі спогади; друга стрибнула
  на серце й узяла думки, а третя стала осторонь і мовила:</p>
  <blockquote>
    <p>«Ти зла».</p>
  </blockquote>
  <p>Потому всі три жабки стрибнули знову у воду.</p>
  <blockquote>
    <p>— У тім джелельці видко мої спогади й думки. Усе, що я зчинила доброго і злого, усе, що вгледіла й навіть мої
    сни.</p>
  </blockquote>
</section>

<section id="section8">
  <p>
    <span className="page-number text-gray-500 text-sm italic mr-2">Ст 112</span>
  </p>
  <p>
  Ти з пороху сотворив чоловіка і з ребра його жінку йому. Ян мружив очі, але надарма — у грудях пекло. Троє
  співців не підіймалися на хори, а стали поряд.
  </p>
  <blockquote>
    <p>— Йоане…</p>
  </blockquote>
  <p>— голос отця Стахія лунав здалеку. Ян з Іво мали одне ім’я на двох, бо обоє скорочені від одного.</p>
  <blockquote>
    <p>— Йоане, чи не обіцявся ти іншій?</p>
  </blockquote>
  <p>Іншій… Він, може, і хтів би іншої, але іншої не має, коли в його очах одна. Ця жінка, сповита усміхом, прийшла до
  нього без вибору. Одна на цілому світі. Супроти правди, совісті, брата…</p>
  <blockquote>
    <p>«Як Авраам і Сара, як Ісак і Ревека, як Яків і Рахіль, як Йосип і Асинефа, як Мойсей і Сепфора…»</p>
  </blockquote>
  <p>Він вдів їй на палець срібний перстеник. Коли вони вийшли із церкви день був таким сліпучим, що здавався
  білим. Вони не могли напитися того дня, обійшли його колом: від пообіддя до смеркання. І той день був їм круглий,
  як горіх. Ян узяв той горіх і сховав у дідову скриньку, аби той, бува, не впав і не розколовся надвоє.</p>
  <p>Вони стояли обіч вікна. Вітер здіймав завіски, як пташині крила. Вітрильник плив до дальніх берегів.</p>
  <blockquote>
    <p>«З якого полотна пошить йому вітрила?»</p>
  </blockquote>
  <blockquote>
    <p>«Коли пошиєш із білого, то плистиму далеко, за обрій, повз сім островів. А як із чорного пошиєш, однаково не втону,
    однаково мину всі сім смертей і за сім літ вернусь до тебе. Коли ж зустрінеш човен без керма, то не питай
    із якого полотна колись той мав вітрила».</p>
  </blockquote>
</section>

<section id="section9">
  <p>
    <span className="page-number text-gray-500 text-sm italic mr-2">Ст 116</span>
  </p>
  <p>
  Геля урвала його оповідку і продовжила свою. Вона водила черепаховим гребінцем по Златчиних косах і далі
    переповідала поему про дивне місто «Єлу-Салим», і про страшного велетня-черкеса, якого здолав відважний
    лицар Танкред. Але в герці він зазнав смертельних ран і ледь живого його знайшла царівна. Ермінія, дочка владника
    сарацинів. Вона обтяла своє чудодійне волосся і сповила рани Танкреда.
  </p>
  <blockquote>
    <p>— Хіба таке буває, Злато? Золоті коси — цілющі, ніби мед…</p>
  </blockquote>
</section>

<section id="section10">
  <p>
    <span className="page-number text-gray-500 text-sm italic mr-2">Ст 133</span>
  </p>
  <p>
  Дівча слухало й засинало. Злата лишила її в ліжку. Вділа кофту й до вікна — худі корови. Вони знедавна прийшли в
    місто. Бридкі і з вигляду: трикутні плечі, шкіра та кістки, а язики в них гострі, як лезо, як кинджал, як
    крик. Вони ховались у порожніх будинках, а по ночах ходили вулицями й зазирали у вікна. Їхній погляд витримати
    важко, він жовтий, як і все довкруж.
  </p>
  <p>
    Люди завішували вікна гардинами, завісками, чорним полотном, а як не було — забивали в шибки дошки, а у вуха
    лили віск, аби реву їхнього не чути. Казали, що їх немає, і ніколи не було. А як побачите, то не дивіться,
    як упізнає хто — не вірить най очам.
  </p>
  <p>
    Худі корови їдять усе, що бачать, і наїстися не годні, їдять знову: пшеницю, хліб, овочі, усе, що впаде, зелені
    паростки, торішнє листя, кору з дерев і навіть гниле. Вони все зжерли дочиста, і ще ненатлі, ще їдять…
  </p>
  <p>
    Літо не приходило. Уже третій місяць відталь. Сльота, мокрий сніг чи дощ. Сонце застигло й не гріло, дерева мерзли
    й на землі нічого не росло. Трава, насіння і ярина — усе, що вибилось із-під снігу, вже давно корови
    з’їли, і далі їли те, що люд ховав од них. Не вірити в них було все важче, вони гуляли вулицями тепер почасту навіть
    удень.
  </p>
  <blockquote>
    <p>— Я бачила дракона, але вони страшніші.</p>
  </blockquote>
  <p>Подейкують, за містом вони вже проковтнули інших корів, овець і коней. Коли не стане і крихти, то їстимуть
  людей?</p>
  <p>Бридкі з вигляду, тілом худі. Язик, як ніж, трикутні плечі й очі — обвуглені вогні. У них стигнуть сльози й меркнуть
  дні.</p>
</section>

<section id="section11">
  <p>
    <span className="page-number text-gray-500 text-sm italic mr-2">Ст 152</span>
  </p>
  <p>
  Він посміхнувся — скляні у нього очі! — і подякував дружині за гостю чарівну.
  </p>
  <blockquote>
    <p>— Мій імператоре, я буду втішена сьогодні. Бо ви забудете про мене, і цієї ночі клюватимете не мою шию і
    питимете не мою кров, — вона нервово смикнула свій високий комірець і вийшла.</p>
  </blockquote>
  <p>Злата поклала ключ туди, звідки взяла. Нерон увімкнув світло — і зі всіх дзеркал у неї вп’ялися: шакали і змії,
  жаби і крокодили, мавпи і пси. Кам’яне серце спрагле за красою. Лиш їй не страшно, вона вже бачила всі
  голови, цих звірів у криниці спогадів у Яна. Вона вже знає всіх богів Нерона. І Творець над ними звершив суд, коли
  розтяв надвоє море. Але чому ж Він не втопив у ньому всі білі острови!</p>
  <blockquote>
    <p>— Сідай, моя красива госте, я розкажу тобі про свого сина, — Нерон підвів її до краю ложа. — Він здібний, але я
    непокоюся за нього. Це зрозуміло, як кожен батько я пильную його душу й тіло. І якось він утратив
    сон. Удень ходить змарнілий, не має сили вивчити напам’ять жодної із книг. Він став чутливіший до сміху,
    звідкись узнав про земні радість і біль. Що вдіялось із моїм байдужим хлопцем? Хтось краде його
    сон! І я мав взнати крадія. Сім ночей поспіль мої найвідданіші офіцери чатували при його дверях. І жоден не міг
    устояти — опівночі вони корилися сну. Тоді я сам пристав на варту. І що ж я бачив? У руці його
    перо незвіданої птиці. Теплом, не жаром, світиться воно. І хлопчик мій не ладен зупиниться, не всне, а дивиться
    на нього всю ніч. Поранком я витяг із його скриньки — перо жар-птиці? — пасмо кіс! Тоді я зажадав
    для себе жінки з таким волоссям. Гіркого меду чи вогню ковтну, а може, і нап’юся.</p>
  </blockquote>
  <p>Імператор узяв її за руку й ураз срібний перстеник обпік йому долоню. Очі зі скла надбились і затремтіли —
  він знову відчуває біль… Скеля здригнулася, у неї бив нещадно молот — божевільний стукіт почувся
  із кам’яних грудей. Він став так ясно бачити й чути, мов перетворений на звіра чи одну із птиць. Пісок багряний
  звів на нього дикі крики, серце тремтіло, наче небо в день грози. Забуте відчуття — рука йому пекла,
  горіла від якоїсь дрібки. Земний біль ниций, він позбавлений краси.</p>
  <blockquote>
    <p>— Відьма!</p>
  </blockquote>
</section>

<section id="section12">
  <p>
    <span className="page-number text-gray-500 text-sm italic mr-2">Ст 160</span>
  </p>
  <p>
  Ян ішов від неї із серцем-камінцем. Ішов, аби не озирнутись, аби піти. Терен під снігом, голі модрини, дужі дуби.
    Минулої ночі стояв попід ними табір чудний. Слідів не лишилось, тут ходять безслідно, лиш при деревах повно
    драбин. Високі й гінкі, до самого неба як треба — дістануть, як треба — зійдуть. Із верху до низу, із низу до верху
    ступатимуть на ті високі щаблі лиш ті, що вміють ходити безслідно, й інші, котрі йдуть на поклик зорі.
    Їхні кроки примітні, у золото вбрані, пахучі, як ладан, як смирна смутні.
  </p>
  <p>
    Ян минає той табір, звертає на стежку. Уже хмариться, взимку так швидко темніє. Блукав він довго, самітником у
    лісі, аж ось бачить, як біля річки ходить супутник. Хітон, сандалі — як не змерзне? — спис-палиця і торба
    через плече. Він ішов на віддалі, в обхід. Та Ян звернув до нього скоро, стрибнув до річки й перетяв дорогу.
  </p>
  <blockquote>
    <p>— Відступися.</p>
  </blockquote>
  <p>Ян відказав:</p>
  <blockquote>
    <p>— Не пущу, доки не розкажеш, як вернути час.</p>
  </blockquote>
  <p>Супутник не зважав на те і хтів іти далі. Ступив у річку — умить кригою вкрилася вода. Слухняно. Як у кожну ніч
  проти Різдва. Ян наздогнав, схопив за руку й боровся з ним посеред змерзлої ріки. Боровся всю ніч, до
  самої зорі.</p>
  <p>Супутник бачить, що не подужає:</p>
  <blockquote>
    <p>— Пусти, бо вже світає.</p>
  </blockquote>
  <blockquote>
    <p>— Та ж не пущу, доки не відкриєш мені шлях на Білий острів.</p>
  </blockquote>
  <blockquote>
    <p>— Навіщо хочеш туди вернути? Бо обіцяв владнику, найнегіднішому з людей? Чому так побиваєшся за словом,
    яке віддав йому в дощовий день?</p>
  </blockquote>
  <blockquote>
    <p>— Я обіцяв, та не йому. Тому, Хто наді мною і над ним. Я обіцяв Йому багато — сім років за ту, що вкрав у брата.</p>
  </blockquote>
  <blockquote>
    <p>— Пусти!</p>
  </blockquote>
  <p>— супутник не збирався поступатись. Уже ніч минала. Вони обидва змерзли, їхні тіла сплетені в боротьбі, їхні подихи близькі. І Ян
  не втримався:</p>
  <blockquote>
    <p>— Назви мені хоча би своє ім’я.</p>
  </blockquote>
  <p>Супутник здивувався:</p>
  <blockquote>
    <p>— Стільки часу Я з тобою, а ти не знаєш імені Мого?</p>
  </blockquote>
  <blockquote>
    <p>— Тоді… Тоді благослови мене на шлях, котрим я піду.</p>
  </blockquote>
  <blockquote>
    <p>— Ти в цьому певен? Направду хочеш? Зможеш іти?</p>
  </blockquote>
  <blockquote>
    <p>— Не пущу, доки не поблагословиш!</p>
  </blockquote>
  <p>Тоді супутник ударив списом йому в ногу в саме стегно, удруге вдарив у твердий лід. І пішов. Ян упав, і скресла
  крига. Риби вистрибували з річки, а він топився в ній.</p>
</section>

 <section id="section1">
             <p>
    Ян же був затятий, він ніяк не хтів миритись
    із батьковою недугою. Очі
    йому
    пекли, коли бачив Йована з кипарисовою
    палицею.
  </p>
  <blockquote>
    <p>
      — <span className="italic underline text-blue-500 hover:text-blue-700">Коли
        приймаємо добре, чи ж злого не приймемо?</span>
      — щораз повторював
      батько.
    </p>
  </blockquote>
    <p>
        «Ні!»
        — кричало все Янове нутро. І він надумав
        щодня ходити до моря
        вудити <span className="italic underline text-blue-500 hover:text-blue-700">дивну
        рибу, що повертає зір. Якщо вмитися тією рибою, то полуда впаде з очей і невидющий бачитиме, як і перше.</span>
    </p>
    <p>
        Йован
        із сумом ворушив коротко стрижене синове
        волосся. Він пам’ятав,
        що воно темне, але з білим пасмом, як і
        в Іво. Авреля завжди казала,
        що
        хтось дуже світлий торкнувся її синів.
    </p>
    <blockquote>
        <p>
            — Непримиренний 
            мій Яне, ти ж рибу як слід не вмієш вудити,
            а що
            за
            дивину собі вигадав. Хоч ти не любиш
            моря, і зовні спокійний — ніхто
            й не розбере твоєї думки, але <button onClick={togglePage} className="italic underline text-blue-500 hover:text-blue-700">зсередини
            ти збурений</button>,
            мов бідою. Що
            з
            тебе буде, сину?
        </p>
    </blockquote>
    <p>
        Ян
        нікого не слухав. Зранку, лишень замріло,
        він узяв батькову вудку, волок
        і пішов до моря. Але дорогою на самому
        березі знову стрів супутника,
        того,
        що кілька років тому вчив його слухати <span className="italic underline text-blue-500 hover:text-blue-700">співи
        всього, що дихає.</span> Був
        той
        чоловік якийсь дивак. Вдітий по-давньому
        — у хітоні
        синій гіматій
        через
        плече. Мав він із собою торбу, як
        мандрівець, і гостру палицю, схожу
        на спис. Нею він знову щось
        креслив на піску.
    </p>
    <p>
        — Я
        не розберу, що ти малюєш, — спинився
        коло нього Ян. Очі завжди
        хотілося
        примружити, бо той ніби зумисно ставав
        проти сонця.
    </p>
    <p>
        <span className="italic underline text-blue-500 hover:text-blue-700">
        — Рибу, 
        </span>  ти ж прийшов по неї.
    </p>
    <p>
        — Мені
        треба справжньої, а ця лише креслена на
        піску. — То злови.
    </p>
    <p>
        — Будь
        певен — зловлю, і мій батько бачитиме!
    </p>
    <p>
        Хлопець
        витяг вудку й волок, але дати раду з тим
        він як слід не вмів, тому
        хапав
        рибу голіруч. Силувався втримати,
        борсався між хвиль. Бо знав, що
        мати
        не спить зрання, і чекає на нього біля
        кипарисів. Чекає з надією, що
        він
        якось вернеться із цілющою
        рибою і
        Йован знову побачить цей, <Link href="/library/bible/gospel-of-john/#section1" 
        onClick={() => {setNewId('28')}} 
        className="italic underline text-blue-500 hover:text-blue-700">
        витятий
        із голосу та слова, світ.
        </Link>
    </p>
    <p>
        Так
        ходив Ян вудити щоранку багато днів, а <span className="italic underline text-blue-500 hover:text-blue-700">
        дивна риба все тікала з його
        рук.
        </span>
    </p>
</section>

<section id="section2">
  <p>
  <span className="page-number text-gray-500 text-sm italic mr-2">Ст 33-34</span>
  </p>
  <p>
    Мерхле світло в кірсі Святого Петра нагадувало пріле скло, бо в очах тьмарилось і ноги чомусь боліли. У заповненій ущент
    залі слухали орган.
  </p>
  <p>
    Але грав на ньому не органіст. <strong>Дудар!</strong> Строкатий дудар із міста Гамельн.
  </p>
  <p>
    Він кликав тих, хто його слухав, із собою, і вони йшли через міст, крізь браму, за місто. Заклятою стежкою, на кручу,
    туди, де топляться в річці, де річка подібна до горла змії.
  </p>
  <p>
    Вони підступали до краю і стихали. Зсередини поривала бистрінь. Вітром — вітряно, світлом — меркло, болем —
    зім’ято. Музика скла дрібнилася, мов бите дзеркало, і злітала кому в руку, кому в голову, кому в око.
  </p>
  <blockquote>
    <p>Коли він скаже їм: «Киньтесь із кручі!»— вони, не вагаючись, униз упадуть.</p>
  </blockquote>
  <p>
    Теофіл Зіхтер дивився на обличчя довкола. І не бачив лиш одного — Янового.
  </p>
  <p>
    Але він чув його. Дударя! Пересмішника… Музика крала волю і він теж ішов за ним. Хіба лиш воску залити у груди,
    інакше не можеш не йти!
  </p>
  <p>
    Теофіл підвівся і ступив на вулицю ковтнуть повітря. Та орган було добре чути і знадвору. Перехожі спинялись.
    Уражені. І лиш він один бачив, як дрібне каміння скочувалося гребенем даху. Тієї кірхи, де він стільки років грав
    во славу!
  </p>
  <p>
    Він дивився на ці тремтливі стіни, зранений дах, але не дивувався. Бо вже не вперше помічав, що таке діялося, коли
    Ян брався за орга́н. А одного разу під час його гри блискавка зрізала три вежі храму через дорогу від концертної
    зали. Теофіл Зіхтер відчував таку жагучу втому, ніби сходив сотню миль, сотню черевик і сотню ніг.
  </p>
</section>    
</div>

{showPage && 
<div className={`${showPage ? "px-3 md:pt-0 pt-3 border-2 border-blue-200 rounded-lg md:border-none md:w-1/2 md:h-screen h-40vh w-full overflow-y-scroll" : "w-full"} `}>
<button className="float-right text-gray-700 hover:text-blue-400 transition-colors duration-200" 
    onClick={() => {setShowPage(false)}}>
    <CircleX/>
</button>
<ul className="pl-0 pt-10 w-full ">
    <li className="mb-3 block rounded-lg hover:bg-blue-200 dark:hover:text-stone-800 transition-colors duration-200">
        <div className="flex justify-between items-start">
            <Link   href='/library/avgustine/#imp'  
                    onClick={() => {setNewId('25')}}
                    >
                 <span className="text-blue-500 underline">Одначе як я волатиму до Бога мого, Бога й Господа мого?</span>
                <span className="text-black ml-2 dark:text-white">в книзі &rdquo;Сповідь&rdquo; блаженного Августина</span>
            </Link>

            <button onClick={() => setExpanded1(curr => !curr)}
                    className="">
                {expanded1 ? <ChevronUp/> : <ChevronDown/>}
            </button>
        </div>
        <p className={`text-gray-700 mt-5 ${expanded1 ? "" : "hidden"}`}>
        «Святий Авґустин (354—430) — християнський теолог, вчитель Церкви, філософ, ритор, єпископ. За його власними свідченнями, ним було створено 232 книги; збереглися також 224 листи і понад 500 текстів проповідей. Спосіб викладу матеріалу в цих працях відповідає бурхливому, неспокійному характеру автора. Про нього говорили, що ні в кого з великих мислителів не було таких перепадів між найвищим і найнижчим, що серед церковних святих він був найменш святим і найбільше людиною. <br />
        «Сповідь» — автобіографічний твір, у якому Авґустин у формі молитви розповідає про своє життя, що відрізнялося занепокоєнням, постійним пошуком і багатьма помилками, про свій досвід грішника, котрий відкрив шлях до Бога, саме у Ньому віднайшов усе, чого шукав. Він вважав, що нема святих без минулого, нема грішників без майбутнього. У молодому віці Авґустин втратив віру в Бога, переживав духовну еволюцію і лише згодом повернувся до Церкви і був визнаний взірцем християнського способу життя і служіння».</p> 
    </li>

    

    </ul>
</div> }
</div>
         </div>  
         );
         }